<?

class Items
{
	static $weaponsStandart = '[1:-1,2:-1,4:-1,5:-1,9:-1,17:-1,39:-1,49:-1]';

	# Автозаполняется автоматически из related_recipes позже, оставить пустым
	static $recipes = [];

	# Связь крафтов
	/*
	Один элемент = Одно улучшение оружия
	(пример 313 в 1.11)
	-----------------
	Один элемент в массиве[] = Одно улучшение
	(Нигде такого нет, т.к. эквивалентно одному элементу без массива, можно было написать 313 как [313] в 1.11,
	но смысла в этом нет)
	-----------------
	Несколько элементов в массиве[] = Последовательные улучшения
	(пример [322, 323] в 1.11)
	-----------------
	Массив[] в массиве[] = На выбор что-то одно из этого массива
	(пример [301, [302, 303]] в 1.11, сначала нужно обязательно 301, потом на выбор 302 или 303)
	(пример [[338, 339]] в 1.11 это НЕ последовательность из-за массива в массиве,
	а выбор 338 ИЛИ 339, а вот последовательность была если бы было [338, 339])
	Обратите ВНИМАНИЕ на параллельные ветки в этом примере:
	[[391, 418], [417, 419]] в 1.39, т.е. сначала на первом этапе крафта на выбор 391 или 418,
	потом на втором этапе опять на выбор 417 или 419,
	т.е. получается, что первая последовательная цепочка (ветка улучшений) это 391 + 417, а вторая 418 + 419
	Т.е. [[391, 418], [417, 419]] - написать правильно, а
	вот [[391, 417], [418, 419]] - НЕПРАВИЛЬНО! (думая, что как будто это последовательные цепочки)
	Здесь цепочки это первые с первыми, вторые со вторыми и т.д., т.е. в первом подмассиве у нас [391, 418],
	а во втором [417, 419], это значит, что первый в первом (это 391) будет соединён с первым во втором (это 417),
	то же самое будет с 418 и 419
	 */
	static $related_recipes =
		[
			'1.11' =>
				[
					[Weapons::CLUSTER_BOMB_UPG_1, [Weapons::CLUSTER_BOMB_UPG_2A, Weapons::CLUSTER_BOMB_UPG_2B]],
					[Weapons::MORTAR_UPG_1, [Weapons::MORTAR_RADIUS, Weapons::MORTAR_DOUBLE_SHOT]],
					[Weapons::SHURIKEN_UPG_1, [Weapons::SHURIKEN_TRAJECTORY, Weapons::SHURIKEN_SAW]],
					[Weapons::STICKY_GRENADE_UPG_1, [Weapons::STICKY_GRENADE_POISON, Weapons::STICKY_GRENADE_BOM_MINE]],
					Weapons::SNIPER_RIFLE_UPG_1,
					[Weapons::SHOTGUN_UPG_1, [Weapons::SHOTGUN_SLOWING, Weapons::SHOTGUN_DOUBLE_SHOT]],
					[Weapons::MINIGUN_UPG_1, [Weapons::MINIGUN_REDUCE_ARMOR, Weapons::MINIGUN_ROCKET]],
					[Weapons::BAZOOKA_UPG_1, Weapons::CUMULATIVE_BAZOOKA],
					[Weapons::STUFFED_BOUNCING_GRENADE, Weapons::GRENADE_UPG_2],
					Weapons::RIFLE_UPG_1,
					[Weapons::HOMING_BAZOOKA_UPG_1, Weapons::HOMING_BAZOOKA_UPG_2],
					[Weapons::ELECTRIC_HARPOON_UPG_1, [Weapons::ELECTRIC_HARPOON_BOOST_DMG, Weapons::ENERGY_RIFLE]],
					[Weapons::BLOW_TORCH_UPG_1, Weapons::BLOW_TORCH_UPG_2],
					[Weapons::MINE_UPG_1, Weapons::MINE_UPG_2],
					Weapons::UZI_UPG_1,
					Weapons::LASER_UPG_1,
					Weapons::HOLY_GRENADE_UPG_1,
					Weapons::SPIDER_UPG_1,
					[[Weapons::DYNAMITE_BUNCH, Weapons::DYNAMITE_KAMIKAZE]],
					[Weapons::CANNON_UPG_1, Weapons::CANNON_UPG_2],
					Weapons::SHOCKER_UPG_1,
					[Weapons::CARPET_BAZOOKA_UPG_1, [Weapons::CARPET_BAZOOKA_BOUNCE_PLUS, Weapons::CARPET_BAZOOKA_FIRE]],
					Weapons::ELASTIC_GIRDER,
					[[Weapons::CONTROLLED_SHEEP, Weapons::BURNING_SHEEP]],
					[Weapons::EMERGENCY_TELEPORT_UPG_1, Weapons::EMERGENCY_TELEPORT_UPG_2],
					[Weapons::BOOMERANG_UPG_1, Weapons::BOOMERANG_UPG_2],
					Weapons::TELEPORT_THROWER_UPG_1,
					[Weapons::ANTIFREEZE_POISON_CURE, [Weapons::ANTIFREEZE_BOOST_ATTACK, Weapons::ANTIFREEZE_BOOST_ARMOR]]
				],

			'1.26' =>
				[
					[Weapons::DRILL_UPG1, Weapons::DRILL_UPG2],
					Weapons::PARASITE_UPG1,
					[Weapons::RIFLE_UPG_1, Weapons::RIFLE_UPG_2],
					[Weapons::SNIPER_RIFLE_UPG_1, [Weapons::SNIPER_RIFLE_UPG_2A, Weapons::SNIPER_RIFLE_UPG_2B]],
					Weapons::AIR_STRIKE_UPG_1,
					[Weapons::BLOCKER_UPG_1, [Weapons::BLOCKER_DARK, Weapons::BLOCKER_LIGHT]],
					Weapons::THUNDERBOLT_UPG_1,
					Weapons::GAS_GRENADE_UPG1,
					[Weapons::SHOCKER_UPG_1, Weapons::SHOCKER_UPG_2],
					[Weapons::BUNKER_BUSTER_UPG1, Weapons::BUNKER_BUSTER_UPG2],
					Weapons::METEOR_UPG1,
					Weapons::TELEPORT_UPG1,
					Weapons::MOLOTOV_UPG1,
					[Weapons::AK_47_UPG_1, Weapons::AK_47_UPG_2],
					Weapons::CARPET_STRIKE_UPG_1,
					[Weapons::LASER_GUN_UPG_1, [Weapons::LASER_GUN_UPG_2A, Weapons::LASER_GUN_UPG_2B]],
					Weapons::NAPALM_STRIKE_UPG_1,
					Weapons::ROPE_UPG_1,
					[Weapons::GRAVITY_GUN_UPG_1, Weapons::GRAVITY_GUN_UPG_2],
					[Weapons::UFO_UPG_1, Weapons::UFO_UPG_2],
					[Weapons::SUPER_SHEEP_UPG_1, Weapons::SUPER_SHEEP_UPG_2],
					[Weapons::LASER_UPG_1, Weapons::LASER_UPG_2],
					[Weapons::HOLY_GRENADE_UPG_1, Weapons::HOLY_GRENADE_UPG_2],
					Weapons::FREEZING_BAZOOKA_UPG1,
					Weapons::PUSHING_MINE_UPG1,
					Weapons::SLEDGEHAMMER_UPG1,
					Weapons::BAT_UPG1,
					Weapons::WATERMELON_UPG1,
					[Weapons::EMERGENCY_TELEPORT_UPG_1, Weapons::EMERGENCY_TELEPORT_UPG_2, Weapons::EMERGENCY_TELEPORT_UPG_3]
				],

			'1.29' =>
				[
					[Weapons::ELASTIC_GIRDER, Weapons::GIRDER_UPG_2],
					[Weapons::ROPE_UPG_1, Weapons::ROPE_UPG_2],
					[[Weapons::SLEDGEHAMMER_UPG1, Weapons::SLEDGEHAMMER_UPG_1B]],
					[Weapons::SUPER_SHEEP_UPG_1, [Weapons::SUPER_SHEEP_UPG_2, Weapons::SUPER_SHEEP_UPG_2B]],
					[Weapons::SNOWFLAKE_STRIKE_UPG_1, [Weapons::SNOWFLAKE_STRIKE_UPG_2A, Weapons::SNOWFLAKE_STRIKE_UPG_2B]]
				],

			'1.33' =>
				[
					[Weapons::TELEPORT_ANCHOR_UPG_1, Weapons::TELEPORT_ANCHOR_UPG_2],
					Weapons::GIRDER_GUN_UPG_1,
					Weapons::FLAMETHROWER_UPG_1,
					[Weapons::DRILL_GUN_UPG_1, Weapons::DRILL_GUN_UPG_2],
					[Weapons::PARASITE_UPG1, Weapons::PARASITE_UPG_2],
					Weapons::BOULDER_UPG_1,
					[[Weapons::TELEPORT_UPG1, Weapons::TELEPORT_UPG_1B]]
				],

			'1.36' =>
				[
					[[Weapons::GUARDING_BOT_UPG_1A, Weapons::GUARDING_BOT_UPG_1B]],
					Weapons::AIR_BLOCKER_UPG_1
				],

			'1.38' =>
				[
					[Weapons::BOULDER_UPG_1, Weapons::BOULDER_UPG_2]
				],

			'1.39' =>
				[
					[[Weapons::FREEZING_BAZOOKA_UPG1, Weapons::FREEZING_BAZOOKA_UPG1B], [Weapons::FREEZING_BAZOOKA_UPG2A, Weapons::FREEZING_BAZOOKA_UPG2B]],
					[[Weapons::GAS_GRENADE_UPG1, Weapons::GAS_GRENADE_UPG_1B]],
					[[Weapons::SPIDER_UPG_1, Weapons::SPIDER_UPG_1B]],
					[Weapons::HOLY_GRENADE_UPG_1, [Weapons::HOLY_GRENADE_UPG_2, Weapons::HOLY_GRENADE_UPG_2B]],
					[[Weapons::AIR_BLOCKER_UPG_1, Weapons::AIR_BLOCKER_UPG_1B]]
				],

			'1.43' =>
				[
					[Weapons::BAT_UPG1, [Weapons::BAT_UPG_2A, Weapons::BAT_UPG_2B]],
					[Weapons::SOUL_GUN_UPG_1, [Weapons::SOUL_GUN_UPG_2A, Weapons::SOUL_GUN_UPG_2B]]
				],

#Fixes by Kuroneko start

			'1.47' =>
				[
					[Weapons::GRAVITY_GUN_UPG_1, Weapons::GRAVITY_GUN_UPG_2, Weapons::GRAVITY_GUN_UPG_3],
					[Weapons::EMERGENCY_TELEPORT_UPG_1, Weapons::EMERGENCY_TELEPORT_UPG_2, [Weapons::EMERGENCY_TELEPORT_UPG_3, Weapons::EMERGENCY_TELEPORT_UPG_3B]],
					Weapons::GROUND_BREAKER_UPG_1,
					[Weapons::BOULDER_UPG_1, Weapons::BOULDER_UPG_2, Weapons::BOULDER_UPG_3]
				],

			'1.48' =>
				[
					[[Weapons::AK_47_UPG_1, Weapons::AK_47_UPG_1B], [Weapons::AK_47_UPG_2, Weapons::AK_47_UPG_2B]]
				],

			'1.49' =>
				[

					[Weapons::ENERGY_RIFLE_UPG_1, Weapons::ENERGY_RIFLE_UPG_2, Weapons::ENERGY_RIFLE_UPG_3],

					[Weapons::SNIPER_RIFLE_UPG_1, [Weapons::SNIPER_RIFLE_UPG_2A, Weapons::SNIPER_RIFLE_UPG_2B], [Weapons::SNIPER_RIFLE_UPG_3A, Weapons::SNIPER_RIFLE_UPG_3B]],

					[[Weapons::GAS_GRENADE_UPG1, Weapons::GAS_GRENADE_UPG_1B], [Weapons::GAS_GRENADE_UPG_2A, Weapons::GAS_GRENADE_UPG_2B]],

					[Weapons::FIREWORK_UPG_1, Weapons::FIREWORK_UPG_2]
				],

			'1.52' =>
				[
					[Weapons::PUPPET_U1, [Weapons::PUPPET_U2A, Weapons::PUPPET_U2B]],
					[Weapons::THEIF_ATTACK_U1, [Weapons::THEIF_ATTACK_U2A, Weapons::THEIF_ATTACK_U2B]]
				],

			'1.54' =>
				[
					Weapons::CIRCUS_CANNON_U1,
					Weapons::DISC_LAUNCHER_U1,
					Weapons::ELECTRO_BUOY_CRAFT,
					Weapons::POISON_BOBBER_CRAFT
				]

#Fixes by Kuroneko stop

		];

	static $weapons =
		[
			# одноразовый арбуз 15 и одноразовое ружье 3 под вопросом
			# еще одноразовые: 18
			# 70 - наковальня, может давать сбои, а может нет
			# 79 - прототип дроида Инженера

			'1.04' =>
				[
					1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 23, 24, 25, 26, 27, 28, 29, 30, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 60, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 80
				],

			# ледяной орб 78 (даже был уже в 1.4.0) в 1.11.0 версии вызывает зависание арсенала при заходе в комнату (не в бою)
			# наковальня 70 в 1.11.0 есть, но она не работает
			# не добавлять 207! странные лулзни! например на самом боссе бой может зависнуть
			'1.11' =>
				[
					10059, 10061, 81, 82, 83
				],

			'1.26' =>
				[
					78, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95,
					96, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108,
					109, 110
				],

			'1.27' => [111, 112, 113, 114],

			'1.28' => [115, 208],

			'1.29' => [116, 117],

			'1.30' => [118],

			'1.33' => [119, 120, 121, 122],

			'1.34' => [123, 124, 125, 126, 127, 128],

			'1.35' => [129],

			'1.36' => [130],

			'1.45' => [131, 132, 133, 134, 135],

			'1.46' => [136],

			'1.49' => [137, 138, 139, 31, 140, 141, 142, 143, 144, 145, 146, 147], #142, 143, 144, 145, 146, 147 - оружия боссов, 148 это айди факела в 1.50.0. Факел добавлять нельзя!

			'1.52' => [149],

			'1.53' => [22]
		];

	static $hats =
		[
			'1.11' => [1000, 1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012, 1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023, 1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 1033, 1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045, 1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056, 1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067, 1068, 1069, 1072, 1073, 1074, 1075, 1076, 1077, 1078, 1079, 1080],

			'1.26' => [1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089, 1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100, 1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1111, 1112, 1113, 1114, 1115, 1116, 1117, 1118, 1120, 1121, 1122, 1123, 1124, 1125, 1126, 1127, 1128, 1129, 1130, 1131, 1132, 1133, 1134, 1135, 1136, 1137, 1138, 1139, 1140, 1141, 1142],

			'1.27' => [1143],

			'1.28' => [1144, 1145],

			'1.30' => [1146, 1147],

			'1.33' => [1148, 1149],

			'1.39' => [1150],

			'1.45' => [1109, 1110],

			'1.46' => [1151, 1152],

			'1.47' => [1070],

			'1.51' => [1153, 1154]
		];

	static $craft_hats =
		[
			# в каждом ряду специалльно такое кол-во, добротный, яростный  и т .д.
			# т.к. в каждой строчке модификации одного и того же какого-либо снаряжения
			'1.26' =>
				[
					1501, 1502, 1503, 1504, 1505,
					1511, 1512, 1513, 1514,
					1521, 1522, 1523, 1524, 1525,
					1531, 1532, 1533, 1534, 1535, 1536,
					1541, 1542, 1543, 1544, 1545,
					1551, 1552, 1553, 1554, 1555,
					1561, 1562, 1563, 1564, 1565, 1566,
					1571, 1572, 1573, 1574, 1575, 1576, 1577,
					1581, 1582, 1583, 1584, 1585, 1586,
					1591, 1592, 1593, 1594, 1595, 1596,
					1601, 1602, 1603, 1604, 1605, 1606,
					1611, 1612, 1613, 1614, 1615,
					1621, 1622, 1623, 1624, 1625, 1626,
					1631, 1632, 1633, 1634, 1635, 1636,
					1641, 1642, 1643, 1644, 1645, 1646
				],

			'1.30' =>
				[
					1651, 1652, 1653, 1654, 1655, 1656
				],

			'1.34' =>
				[
					1661, 1662, 1663, 1664, 1665, 1666
				],

			'1.35' =>
				[
					1671, 1672, 1673, 1674, 1675, 1676,
					1681, 1682, 1683, 1684, 1685, 1686
				],

			'1.36' =>
				[
					1691, 1692, 1693, 1694, 1695, 1696
				],

			'1.38' =>
				[
					1701, 1702, 1703, 1704,
					1711, 1712, 1713, 1714
				],

			'1.46' =>
				[
					1721, 1722, 1723, 1724, 1725, 1726,
					1731, 1732, 1733, 1734, 1735, 1736,
					1741, 1742, 1743, 1744, 1745, 1746
				],


			'1.50' =>
				[
					1751, 1752, 1753, 1754, 1755, 1756,
					1761, 1762, 1763, 1764, 1765, 1766,
					1771, 1772, 1773, 1774
				],

			'1.52' =>
				[
					1781, 1782, 1783, 1784, 1785,
					1791, 1792, 1793, 1794, 1795,
					1801, 1802, 1803, 1804, 1805,
					1811, 1812, 1813, 1814, 1815
				]
		];

	static $artifacts =
		[
			'1.11' => [2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012],

			'1.26' => [2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021, 2022, 2023, 2024, 2025, 2026, 2027, 2028, 2029, 2030, 2031, 2032, 2033, 2034, 2035],

			'1.27' => [2036],

			'1.28' => [2037],

			'1.29' => [2038, 2039],

			'1.33' => [2040, 2041],

			'1.39' => [2042],

			'1.40' => [2043, 2044, 2045, 2046, 2047, 2048, 2049],

			'1.47' => [2050, 2051, 2052, 2053, 2054, 2055, 2056, 2057],

			'1.51' => [2058, 2059]
		];

	static $craft_artifacts =
		[
			'1.26' => [2501, 2502, 2503, 2504, 2505, 2506, 2511, 2512, 2513, 2514, 2515, 2521, 2522, 2523, 2524, 2525, 2526, 2531, 2532, 2533, 2534, 2535, 2536, 2541, 2542, 2543, 2544, 2545, 2546, 2551, 2552, 2553, 2554, 2555, 2561, 2562, 2563, 2564, 2565, 2566, 2571, 2572, 2573, 2574],

			'1.30' => [2581, 2582, 2583, 2584, 2585, 2586],

			'1.33' => [2591, 2592, 2593, 2594, 2595, 2596, 2601, 2602, 2603, 2604, 2605, 2606],

			'1.34' => [2611, 2612, 2613, 2614, 2615, 2616],

			'1.38' => [2621, 2622, 2623, 2624, 2625, 2626],

			'1.45' => [2631, 2632, 2633, 2634, 2635, 2636],

			'1.46' => [2641, 2642, 2643, 2644, 2645, 2646, 2651, 2652, 2653, 2654, 2655, 2656, 2661, 2662, 2663, 2664, 2665, 2666],

			'1.51' => [2671, 2672, 2673, 2674, 2675, 2676],

			'1.52' => [2681, 2682, 2683, 2684, 2685, 2691, 2692, 2693, 2694, 2695]
		];

	static $races =
		[
			'1.11' => [0, 2, 3, 4, 5, 6, 7],

			'1.26' => [8, 9, 10, 11, 12, 13]
		];

	static $maps =
		[
			'1.11' =>
				[
					1,
					2,
					3,
					4,
					5,
					6,
					8, 10, 11, 14, 17, 19, 23, 26, 28, 29, 30, 31, 32,
					33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45,
					46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58,
					59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71,
					72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84,
					85, 86, 87, 88, 89, 90, 91, 92],

			'1.26' => [93, 94, 95, 96, 97, 98, 99, 100, 101, 102,
				103, 104, 105, 106, 107, 108, 109, 110, 111,
				112, 113, 114, 115, 116],

			'1.27' => [117, 118],

			'1.28' => [119, 120],

			'1.29' => [121],

			'1.30' => [122, 123],

			'1.31' => [124, 125],

			'1.32' => [126, 127],

			'1.33' => [128, 129],

			'1.34' => [130],

			'1.35' => [131],

			'1.36' => [132, 133],

			'1.37' => [134, 135, 136, 137],

			'1.38' => [138, 139],

			'1.39' => [140, 141]
		];

	static $reagents =
		[
			'1.11' =>
				[
					0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 20, 21, 22,
					23, 24, 25, 26, 40, 41, 42, 43, 44
				],

			'1.26' => [50, 51],

			'1.37' => [52]
		];

	static $boosters =
		[
			'1.26' => [3001, 3002, 3003, 3007, 3008, 3009, 3010, 3011, 3012]
		];

	static $single_bosses =
		[
			'1.11' =>
				[
					1, 2, 3, 4, 5, 6, 7, 8, 9, 10,
					11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21
				],

			'1.26' => [22, 23, 24, 25, 26, 27],

			'1.29' => [28, 29],

			'1.33' => [30]
		];

	static $cooperative_bosses =
		[
			'1.11' => [101, 102, 103, 104, 105, 106],

			'1.26' => [107, 108, 109, 110, 111, 112, 113, 114],

			'1.27' => [115]
		];

	static $weapons_prices =
		[
			'1.11' =>
				[
					1 => [10, null],
					2 => [10, null],
					4 => [660, 7],
					5 => [950, 10],
					6 => [28, null],
					7 => [1200, 12],
					8 => [25, null],
					9 => [1100, 12],
					10 => [2100, 23],
					11 => [60, null],
					12 => [2000, 20],
					13 => [35, null],
					14 => [1800, 19],
					16 => [560, 6],
					17 => [880, 9],
					19 => [800, 8],
					20 => [15, null],
					21 => [16, null],
					23 => [3500, 35],
					24 => [6000, 60],
					25 => [5500, 55],
					26 => [null, 45],
					27 => [5000, 50],
					28 => [null, 55],
					29 => [1500, 15],
					30 => [4300, 43],
					32 => [null, 35],
					33 => [2100, 21],
					34 => [2200, 22],
					35 => [15000, 150],
					36 => [null, 70],
					37 => [4000, 40],
					38 => [2200, 22],
					39 => [800, 8],
					40 => [1800, 18],
					41 => [null, 34],
					42 => [3100, 31],
					43 => [4600, 46],
					44 => [2400, 24],
					45 => [1500, 15],
					46 => [3900, 42],
					47 => [6000, 60],
					48 => [null, 30],
					49 => [2000, 22],
					50 => [2300, 25],
					51 => [3300, 33],
					52 => [3200, 35],
					53 => [2100, 22],
					54 => [2300, 23],
					55 => [2500, 25],
					56 => [2600, 26],
					57 => [null, 56],
					58 => [4400, 44],
					60 => [3800, 38],
					62 => [9999, 99],
					63 => [9999, 99],
					64 => [9999, 99],
					65 => [null, 32],
					66 => [2200, 25],
					67 => [9999, 99],
					68 => [9999, 99],
					69 => [2700, 27],
					70 => [9999, 99],
					71 => [2800, 28],
					72 => [null, 1],
					73 => [2700, 27],
					74 => [7000, 70],
					75 => [9999, 99],
					76 => [3500, 35],
					77 => [9999, 99],
					78 => [9999, 99],
					80 => [null, 1],
					81 => [3000, 30],
					82 => [3600, 36]
				],

			'1.26' =>
				[
					55 => [3300, 33],
					75 => [null, 1],
					83 => [3200, 32],
					84 => [null, 1],
					85 => [null, 1],
					86 => [null, 1],
					87 => [null, 1],
					88 => [null, 1],
					89 => [null, 1],
					90 => [null, 1],
					91 => [null, 1],
					92 => [null, 1],
					93 => [null, 1],
					94 => [4200, 42],
					95 => [3400, 34],
					96 => [5200, 52],
					99 => [null, 1],
					100 => [null, 1],
					101 => [null, 1],
					102 => [null, 1],
					103 => [null, 1],
					104 => [null, 1],
					105 => [5400, 54],
					106 => [null, 1],
					107 => [3700, 37],
					108 => [null, 1],
					109 => [2900, 29],
					110 => [9999, 99],
					201 => [9999, 99],
					202 => [9999, 99],
					203 => [9999, 99],
					204 => [9999, 99],
					205 => [9999, 99],
					206 => [9999, 99]
				],

			'1.30' =>
				[
					111 => [null, 1],
					112 => [null, 1],
					113 => [null, 1],
					114 => [null, 1],
					115 => [9999, 99],
					116 => [5200, 52],
					117 => [null, 34],
					118 => [9999, 99],
					208 => [9999, 99]
				],

			'1.33' =>
				[
					119 => [null, 1],
					120 => [null, 1],
					121 => [null, 1],
					122 => [null, 1]
				],

			'1.34' =>
				[
					123 => [null, 1],
					124 => [null, 1],
					125 => [null, 1],
					126 => [null, 1],
					127 => [null, 1],
					128 => [null, 1]
				],

			'1.35' =>
				[
					129 => [null, 1]
				],

			'1.36' =>
				[
					130 => [null, 1]
				],

			# Kuroneko start
			'1.45' =>
				[
					131 => [4200, 42],
					132 => [150, 1],
					133 => [null, 1],
					134 => [null, 1],
					135 => [null, 1]
				],

			'1.46' =>
				[
					136 => [4200, 42]
				],

			'1.49' =>
				[
					137 => [9999, 99],
					138 => [9999, 99],
					139 => [9999, 99],
					31 => [4400, 44],
					140 => [9999, 99],
					141 => [9999, 99],
					142 => [9999, 99],
					143 => [9999, 99],
					144 => [9999, 99],
					145 => [9999, 99],
					146 => [9999, 99],
					147 => [9999, 99]
				],

			'1.52' =>
				[
					149 => [9999, 99]
				],

			'1.53' =>
				[
					22 => [99999, 70]
					# Именно такая цена стоит у Ионной пушки в оригинале и тесте оригинала
				]
			# Kuroneko end
		];

	static $hats_prices =
		[
			'1.11' =>
				[
					1000 => [6000, null],
					1002 => [5500, null],
					1003 => [1000, 10],
					1004 => [1300, 13],
					1005 => [1800, 18],
					1006 => [null, 12],
					1007 => [2100, 21],
					1008 => [null, 24],
					1009 => [1600, 16],
					1010 => [2200, 22],
					1011 => [null, 27],
					1012 => [3000, null],
					1013 => [null, 36],
					1014 => [4500, null],
					1015 => [4800, 48],
					1016 => [2200, 22],
					1017 => [4800, 48],
					1018 => [null, 12],
					1019 => [1600, 16],
					1020 => [3000, null],
					1021 => [2200, 22],
					1022 => [1300, 13],
					1023 => [1800, 18],
					1024 => [3000, null],
					1025 => [1000, 10],
					1026 => [4500, null],
					1027 => [9999, 99],
					1028 => [7000, 70],
					1029 => [3300, 33],
					1030 => [3800, 38],
					1031 => [2500, 25],
					1032 => [6500, null],
					1033 => [null, 38],
					1034 => [9999, 99],
					1035 => [9999, 99],
					1036 => [9999, 99],
					1037 => [9999, 99],
					1038 => [9999, 99],
					1039 => [9999, 99],
					1040 => [9999, 99],
					1041 => [null, 62],
					1042 => [5200, 52],
					1043 => [9999, 99],
					1044 => [9999, 99],
					1045 => [9999, 99],
					1046 => [9999, 99],
					1047 => [4600, 46],
					1048 => [9999, 99],
					1049 => [9999, 99],
					1050 => [6600, 66],
					1051 => [5400, 54],
					1052 => [7500, null],
					1053 => [9999, 99],
					1054 => [9999, 99],
					1055 => [7800, 78],
					1056 => [null, 72],
					1057 => [5000, 50],
					1058 => [6800, null],
					1059 => [9999, 99],
					1060 => [9999, 99],
					1061 => [7900, 79],
					1062 => [null, 56],
					1063 => [5800, 58],
					1064 => [4200, 42],
					1065 => [4000, 40],
					1066 => [7600, 76],
					1067 => [9999, 99],
					1068 => [9999, 99],
					1069 => [9999, 99],
					1072 => [9999, 99],
					1073 => [9999, 99],
					1074 => [7200, null],
					1075 => [6400, null],
					1076 => [9999, 99],
					1077 => [2800, 28],
					1078 => [2800, 28],
					1079 => [null, 60],
					1080 => [7400, 74]
				],

			'1.26' =>
				[
					1000 => [5800, null],
					1002 => [5200, null],
					1003 => [800, 8],
					1014 => [3700, null],
					1015 => [4100, 41],
					1025 => [800, 8],
					1029 => [3200, 32],
					1030 => [4400, 44],
					1032 => [6200, null],
					1042 => [5400, 54],
					1047 => [5200, 52],
					1052 => [6800, null],
					1057 => [4800, 48],
					1058 => [6400, null],
					1063 => [5700, 57],
					1077 => [2900, 29],
					1078 => [3400, 34],
					1079 => [null, 80],
					1081 => [9999, 99],
					1082 => [9999, 99],
					1083 => [9999, 99],
					1084 => [4500, 45],
					1085 => [9999, 99],
					1086 => [9999, 99],
					1087 => [9999, 99],
					1088 => [9999, 99],
					1089 => [9999, 99],
					1090 => [9999, 99],
					1091 => [3600, null],
					1092 => [9999, 99],
					1093 => [9999, 99],
					1094 => [9999, 99],
					1095 => [null, 46],
					1096 => [9999, 99],
					1097 => [2000, 20],
					1098 => [2600, 26],
					1099 => [9999, 99],
					1100 => [9999, 99],
					1101 => [9999, 99],
					1102 => [1600, 16],
					1103 => [9999, 99],
					1104 => [9999, 99],
					1105 => [9999, 99],
					1106 => [9999, 99],
					1107 => [9999, 99],
					1111 => [9999, 99],
					1112 => [9999, 99],
					1113 => [9999, 99],
					1114 => [9999, 99],
					1115 => [9999, 99],
					1116 => [9999, 99],
					1117 => [9999, 99],
					1118 => [9999, 99],
					1120 => [9999, 99],
					1121 => [8000, null],
					1122 => [4400, 44],
					1123 => [9999, 99],
					1124 => [9999, 99],
					1125 => [9999, 99],
					1126 => [9999, 99],
					1127 => [9999, 99],
					1128 => [9999, 99],
					1129 => [5200, 52],
					1130 => [4600, 46],
					1131 => [3500, 35],
					1132 => [2800, 28],
					1133 => [9999, 99],
					1134 => [9999, 99],
					1135 => [9999, 99],
					1136 => [9999, 99],
					1137 => [9999, 99],
					1138 => [9999, 99],
					1139 => [9999, 99],
					1140 => [9999, 99],
					1141 => [9999, 99],
					1142 => [9999, 99]
				],

			'1.30' =>
				[
					1032 => [5500, null],
					1041 => [null, 60],
					1052 => [6000, null],
					1143 => [9999, 99],
					1144 => [9999, 99],
					1145 => [9999, 99],
					1146 => [9999, 99],
					1147 => [9999, 99]
				],

			'1.33' =>
				[
					1148 => [9999, 99],
					1149 => [9999, 99]
				],

			'1.45' =>
				[
					1109 => [9999, 99],
					1110 => [9999, 99]
				],

			'1.46' =>
				[
					1151 => [9999, 99],
					1152 => [9999, 99]
				],

			'1.47' =>
				[
					1070 => [9999, 99]
				],

			'1.51' =>
				[
					1153 => [9999, 99],
					1154 => [9999, 99]
				]
		];

	static $artifacts_prices =
		[
			'1.11' =>
				[
					2001 => [1500, 15],
					2002 => [1800, 18],
					2003 => [null, 20],
					2004 => [1500, 15],
					2005 => [2300, 23],
					2006 => [null, 26],
					2007 => [9999, 99],
					2008 => [2200, 22],
					2009 => [2500, 25],
					2010 => [2700, 27],
					2011 => [null, 28],
					2013 => [9999, 99]
				],

			'1.26' =>
				[
					2001 => [1300, 13],
					2002 => [1600, 16],
					2003 => [null, 18],
					2004 => [1300, 13],
					2008 => [2000, 20],
					2012 => [3000, 30],
					2013 => [4200, 42],
					2014 => [2100, 21],
					2015 => [2800, 28],
					2016 => [9999, 99],
					2017 => [6400, 64],
					2018 => [9999, 99],
					2019 => [null, 42],
					2020 => [9999, 99],
					2021 => [3200, 32],
					2022 => [9999, 99],
					2023 => [9999, 99],
					2024 => [9999, 99],
					2025 => [9999, 99],
					2026 => [9999, 99],
					2027 => [9999, 99],
					2028 => [3400, 34],
					2029 => [800, 8],
					2030 => [4400, 44],
					2031 => [9999, 99],
					2032 => [9999, 99],
					2033 => [3600, 36],
					2034 => [9999, 99],
					2035 => [9999, 99]
				],

			'1.30' =>
				[
					2036 => [9999, 99],
					2037 => [9999, 99],
					2038 => [9999, 99],
					2039 => [9999, 99]
				],

			'1.33' =>
				[
					2040 => [9999, 99],
					2041 => [9999, 99]
				],

			#Kuroneko Start

			'1.39' =>
				[
					2042 => [5600, 56]
				],

			'1.40' =>
				[
					2043 => [null, 55],
					2044 => [1400, 14],
					2045 => [4000, 40],
					2046 => [3800, 38],
					2047 => [1500, 15],
					2048 => [4600, 46],
					2049 => [6200, 62]
				],

			'1.47' =>
				[
					2050 => [9999, 99],
					2051 => [7000, 70],
					2052 => [2900, 29],
					2053 => [200, 60],
					2054 => [2300, 23],
					2055 => [9999, 99],
					2056 => [3100, 31],
					2057 => [null, 45]
				],

			'1.51' =>
				[
					2058 => [9999, 99],
					2059 => [9999, 99]
				]
			# Kuroneko End
		];

	static $boosters_prices =
		[
			'1.26' =>
				[
					3001 => [null, 5],
					3002 => [null, 25],
					3003 => [null, 60],
					3007 => [600, null],
					3008 => [3000, null],
					3009 => [null, 12],
					3010 => [null, 60],
					3011 => [null, 6],
					3012 => [null, 30]
				],

			'1.35' =>
				[
					3001 => [null, 7],
					3002 => [null, 32],
					3003 => [null, 70]
				]
		];

	static $races_prices =
		[
			'1.11' =>
				[
					0 => [300, 3],
					2 => [300, 3],
					3 => [1000, 10],
					4 => [1600, 16],
					5 => [1200, 12],
					6 => [2500, 25],
					7 => [2800, 28]
				],

			'1.26' =>
				[
					3 => [2000, 20],
					6 => [2300, 23],
					7 => [2600, 26],
					8 => [3000, 30],
					9 => [3400, 34],
					10 => [300, 3],
					11 => [300, 3],
					12 => [1200, 12],
					13 => [3400, 34]
				],

			'1.30' =>
				[
					2 => [1000, 10],
					3 => [3200, 32],
					4 => [2000, 20],
					5 => [1800, 18],
					6 => [3600, 36],
					7 => [4000, 40],
					8 => [4400, 44],
					9 => [4800, 48]
				]
		];

	static $mercenaries_prices =
		[
			-1 => [300, 3],
			-2 => [500, 5],
			-3 => [700, 7],
			-4 => [600, 6],
			-5 => [600, 6],
			-6 => [900, 9],
			-7 => [800, 8],
			-8 => [900, 9],
			-9 => [900, 9],
			-10 => [1000, 10],
			-11 => [900, 9],
			-12 => [1500, 15],
			-13 => [1000, 10],
			-14 => [1100, 11],
			-15 => [1200, 12],
			-16 => [1100, 11],
			-17 => [1300, 13],
			-18 => [1200, 12],
			-19 => [1300, 13],
			-20 => [1200, 12],
			-21 => [1300, 13],
			-22 => [1500, 15],
			-23 => [1300, 13],
			-24 => [1500, 15],
			-25 => [1800, 18],
			-26 => [1400, 14],
			-27 => [1900, 19],
			-28 => [1800, 18],
			-29 => [1800, 18],
			-30 => [2300, 23],
			-31 => [2200, 22],
			-32 => [2100, 21],
			-33 => [2400, 24],
			-34 => [3300, 33],
			-35 => [2600, 26],
			-36 => [3000, 30],
			-37 => [2800, 28],
			-38 => [2900, 29],
			-39 => [4000, 40],
			-40 => [3100, 31],
			-41 => [3300, 33],
			-42 => [1000, 10],
			-43 => [1500, 15],
			-44 => [1600, 16],
			-45 => [2200, 22],
			-46 => [2900, 29]
		];

	static $battles_prices =
		[
			1 => [100, 1],
			5 => [400, 4]
		];

	static $downgrade_weapon_prices =
		[
			[null, 5]
		];

	static $donateClanPrices = [[null, 1]];

	static $reset_params_prices =
		[
			[300, 3]
		];

	static $coliseum_ticket_prices =
		[
			[null, 10]
		];

	static $early_select_race_prices =
		[
			[null, 5]
		];

	static $rename_char_prices =
		[
			[2000, 20]
		];

	static $reserve_slots_prices =
		[
			[4000, 40],
			[10000, 100],
			[20000, 200]
		];

	static $create_clan_prices =
		[
			[3000, null]
		];

	static $rename_clan_prices =
		[
			[null, 5]
		];

	static $change_clan_descr_prices =
		[
			[null, 5]
		];

	static $change_clan_emblem_prices =
		[
			[null, 5]
		];

	static $dailybonus =
		[
			['fuzes' => 50],
			['fuzes' => 75],
			['reaction' => 10],
			['fuzes' => 100],
			['rubins' => 2]
		];

	static $reactionlevels =
		[
			0 => 0,
			1 => 0,
			2 => 1,
			3 => 1,
			4 => 2,
			5 => 2,
			6 => 5,
			7 => 7,
			8 => 10,
			9 => 20,
			10 => 30,
			11 => 45,
			12 => 60,
			13 => 90,
			14 => 130,
			15 => 190,
			16 => 270,
			17 => 380,
			18 => 520,
			19 => 700,
			20 => 930,
			21 => 1210,
			22 => 1550,
			23 => 1950,
			24 => 2410,
			25 => 2930,
			26 => 3480,
			27 => 4060,
			28 => 4620,
			29 => 5150,
			30 => 5600
		];

	#  фузы в рандоме от 40 до 80 будут выдаваться, если выпавшего поштучного оружия у тебя больше 30 единиц (1.30.0 - 1.33.0, fuzy_count = rand 40, 80)
	# для 1.35.0 убери рандом выпадение фузов, ибо их убрали в этой версии
	# рубины в рандоме от одного до двух (именно такое значение стоит в тесте прагматикс и оригинале), так как от 1 до 10 (как сделал ти) - это чистой воды дисбаланс, а такого не должно быть в тесте (1.26.0 - 1.35.0, ruby_count = rand 1, 2)

	static $crate =
		[
			'1.26.0' =>
				[
					'equips' => [1114, 1118, 1138, 2020, 2032],
					'weapons' => [75 => [1, 2, 3], 84 => [1, 2, 3], 85 => [1, 2, 3], 86 => [1, 2, 3], 87 => [1, 2], 88 => [1, 2], 89 => [1, 2, 3], 90 => [1, 2], 91 => [2, 3, 4], 92 => [2, 3, 4], 93 => [2, 3, 4], 99 => [1, 2, 3], 100 => [1, 2, 3], 101 => [1, 2, 3], 102 => [1, 2, 3], 103 => [1, 2, 3], 104 => [1, 2, 3], 106 => [1], 108 => [1, 2, 3], 10059 => [1], 10061 => [1]
					]
				],

			'1.30.0' =>
				[
					'equips' => [1143, 1145],
					'weapons' => [113 => [1, 2, 3], 114 => [1, 2, 3]
					]
				],

			'1.33.0' =>
				[
					'equips' => [1148, 2041],
					'weapons' => [119 => [1, 2, 3], 120 => [1, 2], 121 => [1, 2]
					]
				],
		];

	static $reactionWTF =
		[
			3 => 1,
			6 => 2,
			9 => 3,
			12 => 4,
			15 => 5,
			18 => 6,
			21 => 7,
			24 => 8,
			27 => 9,
			30 => 10,
			33 => 11,
			36 => 12,
			39 => 13,
			42 => 14,
			45 => 15,
			48 => 16,
			51 => 17,
			54 => 18,
			57 => 19,
			60 => 20,
			63 => 21,
			66 => 22,
			69 => 23,
			72 => 24,
			75 => 25,
			78 => 26,
			81 => 27,
			84 => 28,
			87 => 29,
			90 => 30,
			93 => 31,
			96 => 32,
			99 => 33,
			102 => 34,
			105 => 35,
			108 => 36,
			111 => 37,
			114 => 38,
			117 => 39,
			120 => 40
		];

	static $missions =
		[
			# победа
			['fuzes' => 50, 'exp' => 12],
			['fuzes' => 40, 'exp' => 10],
			['fuzes' => 30, 'exp' => 8],
			# ничья
			['fuzes' => 30, 'exp' => 8],
			['fuzes' => 25, 'exp' => 5],
			['fuzes' => 20, 'exp' => 4],
			# поражение
			['fuzes' => 5, 'exp' => 3],
			['fuzes' => 5, 'exp' => 3],
			['fuzes' => 5, 'exp' => 3]
		];

	static $earlyselectrace = [[null, 5]];

	# награды за прохождение
	static $superbossesRewards =
		[
			'1.26.0' =>
				[
					# нормально
					[
						'boss_ids' => [1, 6],
						'fuzes' => 100,
						'exp' => 50,
						'hat' => 1111,
						'weapons' => [72 => 2, 80 => 2],
						'reagents' => [50 => 2, 51 => 1]
					],

					# горячо
					[
						'boss_ids' => [2, 11],
						'fuzes' => 150,
						'exp' => 75,
						'hat' => 1112,
						'weapons' => [72 => 3, 80 => 3],
						'reagents' => [50 => 3, 51 => 1]
					],

					# самое пекло
					[
						'boss_ids' => [4, 12],
						'fuzes' => 200,
						'exp' => 100,
						'hat' => 1113,
						'weapons' => [72 => 5, 80 => 5],
						'reagents' => [50 => 4, 51 => 1]
					],

					# армагеддон
					[
						'boss_ids' => [101, 6],
						'fuzes' => 250,
						'exp' => 120,
						'hat' => 1139,
						'weapons' => [72 => 7, 80 => 7],
						'reagents' => [50 => 5, 51 => 2]
					]
				],

			'1.30.0' =>
				[
					# нормально
					[
						'boss_ids' => [1, 6],
						'fuzes' => 100,
						'exp' => 50,
						'hat' => 1111,
						'weapons' => [72 => 2, 80 => 2],
						'reagents' => [50 => 2]
					],

					# горячо
					[
						'boss_ids' => [2, 11],
						'fuzes' => 130,
						'exp' => 65,
						'hat' => 1112,
						'weapons' => [72 => 2, 80 => 2],
						'reagents' => [50 => 3, 51 => 1]
					],

					# самое пекло
					[
						'boss_ids' => [4, 12],
						'fuzes' => 160,
						'exp' => 80,
						'hat' => 1113,
						'weapons' => [72 => 3, 80 => 3],
						'reagents' => [50 => 4, 51 => 1]
					],

					# армагеддон
					[
						'boss_ids' => [101, 6],
						'fuzes' => 200,
						'exp' => 100,
						'hat' => 1139,
						'weapons' => [72 => 4, 80 => 4],
						'reagents' => [50 => 5, 51 => 2]
					]
				]
		];


	static $soloBossesRewards =
		[
			'1.26.0' =>
				[
					1 =>
						[
							[
								'fuzes' => 90,
								'exp' => 50,
								'weapons' => [55 => 3, 40 => 3, 27 => 2]
							],

							[
								'fuzes' => 60,
								'exp' => 25,
								'weapons' => [10 => 2, 55 => 2, 40 => 2]
							]
						],

					2 =>
						[
							[
								'fuzes' => 90,
								'exp' => 50,
								'weapons' => [52 => 3, 71 => 2, 41 => 2]
							],

							[
								'fuzes' => 60,
								'exp' => 25,
								'weapons' => [52 => 2, 54 => 2, 71 => 1]
							]
						],

					3 =>
						[
							[
								'fuzes' => 90,
								'exp' => 50,
								'weapons' => [73 => 3, 48 => 2, 74 => 2]
							],

							[
								'fuzes' => 60,
								'exp' => 25,
								'weapons' => [44 => 2, 73 => 2, 48 => 1]
							]
						],

					4 =>
						[
							[
								'fuzes' => 90,
								'exp' => 50,
								'weapons' => [44 => 3, 50 => 2, 35 => 3]
							],

							[
								'fuzes' => 60,
								'exp' => 25,
								'weapons' => [52 => 2, 44 => 2, 50 => 1]
							]
						],

					5 =>
						[
							[
								'fuzes' => 90,
								'exp' => 50,
								'weapons' => [55 => 3, 37 => 3, 51 => 2]
							],

							[
								'fuzes' => 60,
								'exp' => 25,
								'weapons' => [55 => 2, 37 => 2, 51 => 1]
							]
						],

					6 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [23 => 2, 30 => 2, 72 => 1]
							],

							[
								'fuzes' => 70,
								'exp' => 25,
								'weapons' => [23 => 2, 30 => 2, 72 => 1]
							]
						],

					7 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [37 => 2, 47 => 1, 28 => 1]
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [37 => 2, 47 => 1, 28 => 1]
							]
						],

					8 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [71 => 2, 65 => 1, 32 => 1]
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [71 => 2, 65 => 1, 32 => 1]
							]
						],

					9 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [11 => 5, 62 => 3, 63 => 3],
								'hat' => 1037
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [11 => 5, 62 => 3, 63 => 3],
								'hat' => 1037
							]
						],

					10 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [11 => 5, 57 => 2, 64 => 2],
								'hat' => 1036
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [11 => 5, 57 => 2, 64 => 2],
								'hat' => 1036
							]
						],

					11 =>
						[
							[
								'rubins' => 2,
								'exp' => 60,
								'weapons' => [41 => 2, 93 => 1, 25 => 2],
								'hat' => 1038
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [41 => 2, 93 => 1, 25 => 2],
								'hat' => 1038
							]
						],

					12 =>
						[
							[
								'rubins' => 2,
								'exp' => 60,
								'weapons' => [32 => 1, 24 => 2, 58 => 2],
								'hat' => 1035
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [32 => 1, 24 => 2, 58 => 2],
								'hat' => 1035
							]
						],

					13 =>
						[
							[
								'rubins' => 2,
								'exp' => 60,
								'weapons' => [64 => 2, 28 => 1, 36 => 1],
								'hat' => 1039
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [64 => 2, 28 => 1, 36 => 1],
								'hat' => 1039
							]
						],

					14 =>
						[
							[
								'rubins' => 2,
								'exp' => 60,
								'weapons' => [69 => 3, 41 => 2, 74 => 2],
								'hat' => 1049
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [69 => 3, 41 => 2, 74 => 2],
								'hat' => 1049
							]
						],

					15 =>
						[
							[
								'rubins' => 2,
								'exp' => 80,
								'weapons' => [68 => 3, 57 => 2, 24 => 2],
								'hat' => 1044
							],

							[
								'fuzes' => 90,
								'exp' => 40,
								'weapons' => [68 => 3, 57 => 2, 24 => 2],
								'hat' => 1044
							]
						],

					16 =>
						[
							[
								'rubins' => 3,
								'exp' => 80,
								'weapons' => [26 => 3, 28 => 2],
								'hat' => [1045, 1046]
							],

							[
								'fuzes' => 90,
								'exp' => 40,
								'weapons' => [26 => 3, 28 => 2],
								'hat' => [1045, 1046]
							]
						],

					17 =>
						[
							[
								'rubins' => 5,
								'exp' => 100,
								'weapons' => [72 => 5, 64 => 3, 57 => 2],
								'hat' => 1043
							],

							[
								'fuzes' => 100,
								'exp' => 50,
								'weapons' => [72 => 2, 64 => 3, 57 => 2],
								'hat' => 1043
							]
						],

					18 =>
						[
							[
								'rubins' => 5,
								'exp' => 100,
								'weapons' => [80 => 5, 88 => 2, 36 => 2],
								'hat' => 1040
							],

							[
								'fuzes' => 100,
								'exp' => 50,
								'weapons' => [80 => 2, 88 => 1, 36 => 2],
								'hat' => 1040
							]
						],

					19 =>
						[
							[
								'rubins' => 5,
								'exp' => 120,
								'weapons' => [72 => 5, 80 => 5, 28 => 4],
								'hat' => 1059
							],

							[
								'fuzes' => 120,
								'exp' => 60,
								'weapons' => [72 => 3, 80 => 3, 28 => 2],
								'hat' => 1059
							]
						],

					20 =>
						[
							[
								'rubins' => 5,
								'exp' => 130,
								'weapons' => [72 => 5, 80 => 5, 36 => 4],
								'hat' => 1060
							],

							[
								'fuzes' => 130,
								'exp' => 65,
								'weapons' => [72 => 3, 80 => 3, 36 => 2],
								'hat' => 1060
							]
						],

					21 =>
						[
							[
								'rubins' => 7,
								'exp' => 140,
								'weapons' => [72 => 8, 80 => 8, 74 => 6],
								'hat' => 1067
							],

							[
								'fuzes' => 130,
								'exp' => 70,
								'weapons' => [72 => 3, 80 => 3, 74 => 4],
								'hat' => 1067
							]
						],

					22 =>
						[
							[
								'rubins' => 7,
								'exp' => 150,
								'weapons' => [72 => 10, 80 => 10, 93 => 4],
								'hat' => 1096
							],

							[
								'fuzes' => 140,
								'exp' => 75,
								'weapons' => [72 => 3, 80 => 3, 93 => 2],
								'hat' => 1096
							]
						],

					23 =>
						[
							[
								'rubins' => 7,
								'exp' => 150,
								'weapons' => [72 => 10, 80 => 10, 84 => 4],
								'hat' => 1103
							],

							[
								'fuzes' => 140,
								'exp' => 75,
								'weapons' => [72 => 3, 80 => 3, 84 => 2],
								'hat' => 1103
							]
						],

					24 =>
						[
							[
								'rubins' => 7,
								'exp' => 150,
								'weapons' => [72 => 10, 80 => 10, 75 => 6],
								'artifact' => 2018
							],

							[
								'fuzes' => 150,
								'exp' => 75,
								'weapons' => [72 => 3, 80 => 3, 75 => 4],
								'artifact' => 2018
							]
						],

					25 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 10, 80 => 10, 103 => 6],
								'hat' => 1135
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 103 => 3],
								'hat' => 1135
							]
						],

					26 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 10, 80 => 10, 101 => 6],
								'artifact' => 2026
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 101 => 3],
								'artifact' => 2026
							]
						],

					27 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 10, 80 => 10, 104 => 4],
								'artifact' => 2027
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 104 => 2],
								'artifact' => 2027
							]
						]
				],

			'1.30.0' =>
				[
					21 =>
						[
							[
								'rubins' => 7,
								'exp' => 140,
								'weapons' => [72 => 6, 80 => 6, 74 => 6],
								'hat' => 1067
							],

							[
								'fuzes' => 130,
								'exp' => 70,
								'weapons' => [72 => 3, 80 => 3, 74 => 3],
								'hat' => 1067
							]
						],

					22 =>
						[
							[
								'rubins' => 7,
								'exp' => 150,
								'weapons' => [72 => 6, 80 => 6, 93 => 4],
								'hat' => 1096
							],

							[
								'fuzes' => 140,
								'exp' => 75,
								'weapons' => [72 => 3, 80 => 3, 93 => 2],
								'hat' => 1096
							]
						],

					23 =>
						[
							[
								'rubins' => 7,
								'exp' => 150,
								'weapons' => [72 => 6, 80 => 6, 84 => 4],
								'hat' => 1103
							],

							[
								'fuzes' => 140,
								'exp' => 75,
								'weapons' => [72 => 3, 80 => 3, 84 => 2],
								'hat' => 1103
							]
						],

					24 =>
						[
							[
								'rubins' => 7,
								'exp' => 150,
								'weapons' => [72 => 6, 80 => 6, 75 => 4],
								'artifact' => 2018
							],

							[
								'fuzes' => 150,
								'exp' => 75,
								'weapons' => [72 => 3, 80 => 3, 75 => 2],
								'artifact' => 2018
							]
						],

					25 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 6, 80 => 6, 103 => 4],
								'hat' => 1135
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 103 => 2],
								'hat' => 1135
							]
						],

					26 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 6, 80 => 6, 101 => 4],
								'artifact' => 2026
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 101 => 2],
								'artifact' => 2026
							]
						],

					27 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 6, 80 => 6, 104 => 3],
								'artifact' => 2027
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 104 => 1],
								'artifact' => 2027
							]
						],

					28 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 6, 80 => 6, 112 => 2],
								'hat' => 1146
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 112 => 1],
								'hat' => 1146
							]
						],

					29 =>
						[
							[
								'rubins' => 8,
								'exp' => 160,
								'weapons' => [72 => 6, 80 => 6, 106 => 2],
								'artifact' => 2039
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [72 => 3, 80 => 3, 106 => 1],
								'artifact' => 2039
							]
						]
				],

			'1.33.0' =>
				[
					30 =>
						[
							[
								'rubins' => 8,
								'exp' => 140,
								'weapons' => [72 => 6, 80 => 6, 119 => 4],
								'hat' => 1149
							],

							[
								'fuzes' => 130,
								'exp' => 70,
								'weapons' => [72 => 3, 80 => 3, 119 => 2],
								'hat' => 1149
							]
						]
				]
		];


	static $craftrecipes =
		[
			'1.26.0' =>
				[
					1 =>
						[
							'prev_upgrade_id' => 5,
							'upgrade_id' => 301,
							'reagents' => [4 => 15, 3 => 25, 26 => 10]
						],

					2 =>
						[
							'prev_upgrade_id' => 301,
							'upgrade_id' => 302,
							'reagents' => [10 => 30, 23 => 20, 42 => 10]
						],

					3 =>
						[
							'prev_upgrade_id' => 301,
							'upgrade_id' => 303,
							'reagents' => [0 => 40, 21 => 15, 41 => 12]
						],

					4 =>
						[
							'prev_upgrade_id' => 9,
							'upgrade_id' => 304,
							'reagents' => [3 => 15, 6 => 15, 20 => 12]
						],

					5 =>
						[
							'prev_upgrade_id' => 304,
							'upgrade_id' => 305,
							'reagents' => [1 => 20, 22 => 20, 41 => 10]
						],

					6 =>
						[
							'prev_upgrade_id' => 304,
							'upgrade_id' => 306,
							'reagents' => [3 => 40, 21 => 10, 44 => 10]
						],

					7 =>
						[
							'prev_upgrade_id' => 45,
							'upgrade_id' => 307,
							'reagents' => [4 => 25, 6 => 18, 22 => 10]
						],

					8 =>
						[
							'prev_upgrade_id' => 307,
							'upgrade_id' => 308,
							'reagents' => [10 => 35, 24 => 15, 40 => 10]
						],

					9 =>
						[
							'prev_upgrade_id' => 307,
							'upgrade_id' => 309,
							'reagents' => [0 => 25, 20 => 15, 44 => 15]
						],

					10 =>
						[
							'prev_upgrade_id' => 29,
							'upgrade_id' => 310,
							'reagents' => [0 => 25, 2 => 15, 21 => 10]
						],

					11 =>
						[
							'prev_upgrade_id' => 310,
							'upgrade_id' => 311,
							'reagents' => [2 => 40, 23 => 12, 40 => 10]
						],

					12 =>
						[
							'prev_upgrade_id' => 310,
							'upgrade_id' => 312,
							'reagents' => [9 => 35, 26 => 20, 42 => 10]
						],

					13 =>
						[
							'prev_upgrade_id' => 23,
							'upgrade_id' => 313,
							'reagents' => [2 => 10, 24 => 18, 43 => 10]
						],

					14 =>
						[
							'prev_upgrade_id' => 14,
							'upgrade_id' => 314,
							'reagents' => [2 => 25, 10 => 20, 23 => 10]
						],

					15 =>
						[
							'prev_upgrade_id' => 314,
							'upgrade_id' => 315,
							'reagents' => [4 => 40, 22 => 15, 40 => 12]
						],

					16 =>
						[
							'prev_upgrade_id' => 314,
							'upgrade_id' => 316,
							'reagents' => [6 => 45, 26 => 15, 44 => 10]
						],

					17 =>
						[
							'prev_upgrade_id' => 10,
							'upgrade_id' => 317,
							'reagents' => [1 => 25, 9 => 20, 24 => 15]
						],

					18 =>
						[
							'prev_upgrade_id' => 317,
							'upgrade_id' => 318,
							'reagents' => [9 => 35, 20 => 15, 41 => 15]
						],

					19 =>
						[
							'prev_upgrade_id' => 317,
							'upgrade_id' => 319,
							'reagents' => [1 => 35, 21 => 15, 42 => 12]
						],

					20 =>
						[
							'prev_upgrade_id' => 1,
							'upgrade_id' => 320,
							'reagents' => [4 => 4, 3 => 4, 6 => 2]
						],

					21 =>
						[
							'prev_upgrade_id' => 320,
							'upgrade_id' => 321,
							'reagents' => [1 => 20, 6 => 20, 22 => 10]
						],

					22 =>
						[
							'prev_upgrade_id' => 2,
							'upgrade_id' => 322,
							'reagents' => [0 => 4, 1 => 4, 10 => 2]
						],

					23 =>
						[
							'prev_upgrade_id' => 322,
							'upgrade_id' => 323,
							'reagents' => [0 => 20, 3 => 15, 23 => 12]
						],

					24 =>
						[
							'prev_upgrade_id' => 4,
							'upgrade_id' => 324,
							'reagents' => [2 => 4, 9 => 6]
						],

					25 =>
						[
							'prev_upgrade_id' => 38,
							'upgrade_id' => 325,
							'reagents' => [0 => 15, 4 => 15, 20 => 12]
						],

					26 =>
						[
							'prev_upgrade_id' => 325,
							'upgrade_id' => 326,
							'reagents' => [10 => 20, 26 => 10, 43 => 10]
						],

					27 =>
						[
							'prev_upgrade_id' => 50,
							'upgrade_id' => 327,
							'reagents' => [2 => 25, 9 => 15, 43 => 8]
						],

					28 =>
						[
							'prev_upgrade_id' => 327,
							'upgrade_id' => 328,
							'reagents' => [10 => 25, 22 => 20, 44 => 12]
						],

					29 =>
						[
							'prev_upgrade_id' => 327,
							'upgrade_id' => 329,
							'reagents' => [9 => 25, 21 => 20, 42 => 12]
						],

					30 =>
						[
							'prev_upgrade_id' => 17,
							'upgrade_id' => 330,
							'reagents' => [1 => 6, 6 => 2, 9 => 2]
						],

					31 =>
						[
							'prev_upgrade_id' => 330,
							'upgrade_id' => 331,
							'reagents' => [4 => 10, 23 => 10, 26 => 8]
						],

					32 =>
						[
							'prev_upgrade_id' => 39,
							'upgrade_id' => 332,
							'reagents' => [0 => 4, 3 => 4, 10 => 6]
						],

					33 =>
						[
							'prev_upgrade_id' => 332,
							'upgrade_id' => 333,
							'reagents' => [3 => 25, 6 => 20, 26 => 10]
						],

					34 =>
						[
							'prev_upgrade_id' => 7,
							'upgrade_id' => 334,
							'reagents' => [2 => 4, 4 => 4, 6 => 6]
						],

					35 =>
						[
							'prev_upgrade_id' => 76,
							'upgrade_id' => 335,
							'reagents' => [3 => 15, 20 => 8, 41 => 8]
						],

					36 =>
						[
							'prev_upgrade_id' => 25,
							'upgrade_id' => 336,
							'reagents' => [2 => 20, 24 => 10, 40 => 10]
						],

					37 =>
						[
							'prev_upgrade_id' => 48,
							'upgrade_id' => 337,
							'reagents' => [1 => 20, 4 => 20, 24 => 12]
						],

					38 =>
						[
							'prev_upgrade_id' => 19,
							'upgrade_id' => 338,
							'reagents' => [3 => 15, 6 => 15, 23 => 12]
						],

					39 =>
						[
							'prev_upgrade_id' => 338,
							'upgrade_id' => 339,
							'reagents' => [4 => 20, 10 => 20, 21 => 15]
						],

					40 =>
						[
							'prev_upgrade_id' => 46,
							'upgrade_id' => 340,
							'reagents' => [6 => 20, 22 => 12, 40 => 8]
						],

					41 =>
						[
							'prev_upgrade_id' => 340,
							'upgrade_id' => 341,
							'reagents' => [20 => 15, 43 => 12, 44 => 5]
						],

					42 =>
						[
							'prev_upgrade_id' => 33,
							'upgrade_id' => 342,
							'reagents' => [0 => 15, 10 => 10, 26 => 12]
						],

					43 =>
						[
							'prev_upgrade_id' => 44,
							'upgrade_id' => 343,
							'reagents' => [2 => 15, 9 => 15, 20 => 12]
						],

					44 =>
						[
							'prev_upgrade_id' => 343,
							'upgrade_id' => 344,
							'reagents' => [0 => 20, 24 => 15, 42 => 10]
						],

					45 =>
						[
							'prev_upgrade_id' => 343,
							'upgrade_id' => 345,
							'reagents' => [4 => 20, 23 => 15, 41 => 10]
						],

					46 =>
						[
							'prev_upgrade_id' => 53,
							'upgrade_id' => 346,
							'reagents' => [1 => 20, 24 => 15, 44 => 5]
						],

					47 =>
						[
							'prev_upgrade_id' => 40,
							'upgrade_id' => 347,
							'reagents' => [1 => 15, 26 => 15, 41 => 8]
						],

					48 =>
						[
							'prev_upgrade_id' => 40,
							'upgrade_id' => 348,
							'reagents' => [6 => 20, 21 => 20, 40 => 12]
						],

					49 =>
						[
							'prev_upgrade_id' => 71,
							'upgrade_id' => 349,
							'reagents' => [9 => 10, 21 => 8, 22 => 8]
						],

					50 =>
						[
							'prev_upgrade_id' => 349,
							'upgrade_id' => 350,
							'reagents' => [4 => 10, 26 => 15, 43 => 10]
						],

					51 =>
						[
							'prev_upgrade_id' => 69,
							'upgrade_id' => 351,
							'reagents' => [2 => 20, 24 => 8, 26 => 8]
						],

					52 =>
						[
							'prev_upgrade_id' => 351,
							'upgrade_id' => 352,
							'reagents' => [20 => 10, 22 => 30, 24 => 15]
						],

					53 =>
						[
							'prev_upgrade_id' => 34,
							'upgrade_id' => 353,
							'reagents' => [20 => 20, 41 => 8, 42 => 12]
						],

					54 =>
						[
							'prev_upgrade_id' => 66,
							'upgrade_id' => 354,
							'reagents' => [0 => 12, 9 => 12, 23 => 12]
						],

					55 =>
						[
							'prev_upgrade_id' => 354,
							'upgrade_id' => 355,
							'reagents' => [10 => 15, 23 => 12, 40 => 10]
						],

					56 =>
						[
							'prev_upgrade_id' => 354,
							'upgrade_id' => 356,
							'reagents' => [3 => 15, 21 => 12, 44 => 10]
						],

					57 =>
						[
							'prev_upgrade_id' => 16,
							'upgrade_id' => 357,
							'reagents' => [1 => 2, 4 => 2, 6 => 6]
						],

					58 =>
						[
							'prev_upgrade_id' => 83,
							'upgrade_id' => 358,
							'reagents' => [22 => 18, 40 => 6, 42 => 8]
						],

					59 =>
						[
							'prev_upgrade_id' => 324,
							'upgrade_id' => 359,
							'reagents' => [4 => 20, 23 => 10, 26 => 10]
						],

					60 =>
						[
							'prev_upgrade_id' => 313,
							'upgrade_id' => 360,
							'reagents' => [23 => 15, 24 => 20, 43 => 10]
						],

					61 =>
						[
							'prev_upgrade_id' => 313,
							'upgrade_id' => 361,
							'reagents' => [20 => 20, 21 => 18, 43 => 8]
						],

					62 =>
						[
							'prev_upgrade_id' => 27,
							'upgrade_id' => 362,
							'reagents' => [20 => 20, 23 => 15, 43 => 8]
						],

					63 =>
						[
							'prev_upgrade_id' => 82,
							'upgrade_id' => 363,
							'reagents' => [9 => 20, 26 => 18, 44 => 8]
						],

					64 =>
						[
							'prev_upgrade_id' => 363,
							'upgrade_id' => 364,
							'reagents' => [3 => 25, 22 => 25, 42 => 8]
						],

					65 =>
						[
							'prev_upgrade_id' => 363,
							'upgrade_id' => 365,
							'reagents' => [24 => 20, 26 => 18, 44 => 10]
						],

					66 =>
						[
							'prev_upgrade_id' => 74,
							'upgrade_id' => 366,
							'reagents' => [21 => 20, 40 => 18, 41 => 10]
						],

					67 =>
						[
							'prev_upgrade_id' => 81,
							'upgrade_id' => 367,
							'reagents' => [2 => 25, 23 => 15, 40 => 10]
						],

					68 =>
						[
							'prev_upgrade_id' => 342,
							'upgrade_id' => 368,
							'reagents' => [4 => 20, 9 => 20, 41 => 8]
						],

					69 =>
						[
							'prev_upgrade_id' => 58,
							'upgrade_id' => 369,
							'reagents' => [1 => 20, 24 => 20, 44 => 10]
						],

					70 =>
						[
							'prev_upgrade_id' => 28,
							'upgrade_id' => 370,
							'reagents' => [3 => 20, 20 => 25, 23 => 25]
						],

					71 =>
						[
							'prev_upgrade_id' => 26,
							'upgrade_id' => 371,
							'reagents' => [0 => 15, 10 => 15, 21 => 10]
						],

					72 =>
						[
							'prev_upgrade_id' => 37,
							'upgrade_id' => 372,
							'reagents' => [6 => 30, 23 => 15, 42 => 8]
						],

					73 =>
						[
							'prev_upgrade_id' => 52,
							'upgrade_id' => 373,
							'reagents' => [2 => 30, 10 => 30, 24 => 12]
						],

					74 =>
						[
							'prev_upgrade_id' => 36,
							'upgrade_id' => 374,
							'reagents' => [3 => 40, 22 => 20, 42 => 15]
						],

					75 =>
						[
							'prev_upgrade_id' => 94,
							'upgrade_id' => 375,
							'reagents' => [0 => 35, 21 => 15, 43 => 10]
						],

					76 =>
						[
							'prev_upgrade_id' => 375,
							'upgrade_id' => 376,
							'reagents' => [9 => 35, 26 => 20, 40 => 15]
						],

					77 =>
						[
							'prev_upgrade_id' => 375,
							'upgrade_id' => 377,
							'reagents' => [4 => 45, 41 => 15, 44 => 10]
						],

					78 =>
						[
							'prev_upgrade_id' => 43,
							'upgrade_id' => 378,
							'reagents' => [6 => 25, 26 => 18, 41 => 8]
						],

					79 =>
						[
							'prev_upgrade_id' => 49,
							'upgrade_id' => 379,
							'reagents' => [1 => 25, 10 => 10, 24 => 15]
						],

					80 =>
						[
							'prev_upgrade_id' => 73,
							'upgrade_id' => 380,
							'reagents' => [0 => 20, 1 => 25, 21 => 10]
						],

					81 =>
						[
							'prev_upgrade_id' => 65,
							'upgrade_id' => 381,
							'reagents' => [0 => 20, 1 => 20, 20 => 20]
						],

					82 =>
						[
							'prev_upgrade_id' => 381,
							'upgrade_id' => 382,
							'reagents' => [22 => 25, 24 => 20, 42 => 15]
						],

					83 =>
						[
							'prev_upgrade_id' => 41,
							'upgrade_id' => 383,
							'reagents' => [6 => 25, 23 => 15, 41 => 5]
						],

					84 =>
						[
							'prev_upgrade_id' => 383,
							'upgrade_id' => 384,
							'reagents' => [10 => 35, 21 => 20, 40 => 10]
						],

					85 =>
						[
							'prev_upgrade_id' => 373,
							'upgrade_id' => 385,
							'reagents' => [2 => 40, 26 => 20, 44 => 8]
						],

					86 =>
						[
							'prev_upgrade_id' => 357,
							'upgrade_id' => 386,
							'reagents' => [1 => 20, 6 => 15, 26 => 10]
						],

					87 =>
						[
							'prev_upgrade_id' => 335,
							'upgrade_id' => 387,
							'reagents' => [20 => 15, 21 => 15, 42 => 8]
						],

					88 =>
						[
							'prev_upgrade_id' => 369,
							'upgrade_id' => 388,
							'reagents' => [3 => 25, 22 => 20, 44 => 12]
						],

					89 =>
						[
							'prev_upgrade_id' => 336,
							'upgrade_id' => 389,
							'reagents' => [9 => 30, 23 => 20, 41 => 10]
						],

					90 =>
						[
							'prev_upgrade_id' => 380,
							'upgrade_id' => 390,
							'reagents' => [22 => 20, 26 => 20, 41 => 10]
						],

					91 =>
						[
							'prev_upgrade_id' => 54,
							'upgrade_id' => 391,
							'reagents' => [4 => 25, 20 => 15, 40 => 10]
						],

					92 =>
						[
							'prev_upgrade_id' => 109,
							'upgrade_id' => 392,
							'reagents' => [0 => 30, 21 => 20, 41 => 8]
						],

					93 =>
						[
							'prev_upgrade_id' => 47,
							'upgrade_id' => 393,
							'reagents' => [20 => 20, 40 => 8, 44 => 8]
						],

					94 =>
						[
							'prev_upgrade_id' => 51,
							'upgrade_id' => 394,
							'reagents' => [2 => 30, 24 => 15, 44 => 8]
						],

					95 =>
						[
							'prev_upgrade_id' => 24,
							'upgrade_id' => 395,
							'reagents' => [1 => 30, 10 => 30, 42 => 12]
						],

					96 =>
						[
							'prev_upgrade_id' => 350,
							'upgrade_id' => 396,
							'reagents' => [20 => 15, 24 => 15, 43 => 10]
						]
				],

			'1.30.0' =>
				[
					97 =>
						[
							'prev_upgrade_id' => 346,
							'upgrade_id' => 397,
							'reagents' => [4 => 25, 26 => 15, 44 => 5]
						],

					98 =>
						[
							'prev_upgrade_id' => 379,
							'upgrade_id' => 398,
							'reagents' => [2 => 20, 9 => 20, 43 => 10]
						],

					99 =>
						[
							'prev_upgrade_id' => 47,
							'upgrade_id' => 399,
							'reagents' => [2 => 25, 22 => 25, 24 => 25]
						],

					100 =>
						[
							'prev_upgrade_id' => 383,
							'upgrade_id' => 400,
							'reagents' => [6 => 10, 23 => 25, 43 => 15]
						],

					101 =>
						[
							'prev_upgrade_id' => 105,
							'upgrade_id' => 401,
							'reagents' => [20 => 15, 21 => 15, 41 => 15]
						],

					102 =>
						[
							'prev_upgrade_id' => 401,
							'upgrade_id' => 402,
							'reagents' => [3 => 40, 6 => 40, 23 => 30]
						],

					103 =>
						[
							'prev_upgrade_id' => 401,
							'upgrade_id' => 403,
							'reagents' => [3 => 40, 6 => 40, 23 => 30]
						]
				],

			'1.33.0' =>
				[
					104 =>
						[
							'prev_upgrade_id' => 116,
							'upgrade_id' => 404,
							'reagents' => [9 => 15, 20 => 10, 42 => 10]
						],

					105 =>
						[
							'prev_upgrade_id' => 404,
							'upgrade_id' => 405,
							'reagents' => [1 => 20, 21 => 20, 42 => 10]
						],

					106 =>
						[
							'prev_upgrade_id' => 117,
							'upgrade_id' => 406,
							'reagents' => [2 => 15, 22 => 15, 26 => 15]
						],

					107 =>
						[
							'prev_upgrade_id' => 30,
							'upgrade_id' => 407,
							'reagents' => [6 => 20, 23 => 15, 43 => 10]
						],

					108 =>
						[
							'prev_upgrade_id' => 12,
							'upgrade_id' => 408,
							'reagents' => [1 => 10, 26 => 15, 44 => 5]
						],

					110 =>
						[
							'prev_upgrade_id' => 358,
							'upgrade_id' => 410,
							'reagents' => [0 => 30, 9 => 30, 41 => 12]
						],

					111 =>
						[
							'prev_upgrade_id' => 95,
							'upgrade_id' => 411,
							'reagents' => [3 => 30, 10 => 20, 44 => 10]
						],

					112 =>
						[
							'prev_upgrade_id' => 26,
							'upgrade_id' => 412,
							'reagents' => [0 => 15, 20 => 10, 40 => 8]
						]
				],

			'1.35.0' =>
				[
					109 =>
						[
							'prev_upgrade_id' => 408,
							'upgrade_id' => 409,
							'reagents' => [4 => 15, 26 => 15, 43 => 8]
						]
				],

			# Kuroneko start

			'1.36.0' =>
				[
					110 =>
						[
							'prev_upgrade_id' => 60,
							'upgrade_id' => 413,
							'reagents' => [4 => 20, 24 => 20, 42 => 12]
						],

					111 =>
						[
							'prev_upgrade_id' => 107,
							'upgrade_id' => 414,
							'reagents' => [1 => 30, 22 => 20, 43 => 12]
						],

					112 =>
						[
							'prev_upgrade_id' => 60,
							'upgrade_id' => 415,
							'reagents' => [2 => 20, 10 => 30, 40 => 10]
						]
				],

			'1.38.0' =>
				[
					113 =>
						[
							'prev_upgrade_id' => 411,
							'upgrade_id' => 416,
							'reagents' => [3 => 20, 24 => 20, 43 => 8]
						]
				],

			'1.39.0' =>
				[
					114 =>
						[
							'prev_upgrade_id' => 391,
							'upgrade_id' => 417,
							'reagents' => [20 => 15, 26 => 20, 44 => 12]
						],

					115 =>
						[
							'prev_upgrade_id' => 54,
							'upgrade_id' => 418,
							'reagents' => [9 => 25, 24 => 15, 40 => 10]
						],

					116 =>
						[
							'prev_upgrade_id' => 418,
							'upgrade_id' => 419,
							'reagents' => [20 => 20, 22 => 15, 43 => 12]
						],

					117 =>
						[
							'prev_upgrade_id' => 81,
							'upgrade_id' => 420,
							'reagents' => [6 => 30, 21 => 15, 41 => 10]
						],

					118 =>
						[
							'prev_upgrade_id' => 48,
							'upgrade_id' => 421,
							'reagents' => [0 => 25, 4 => 25, 42 => 5]
						],

					119 =>
						[
							'prev_upgrade_id' => 389,
							'upgrade_id' => 422,
							'reagents' => [23 => 20, 24 => 15, 26 => 15]
						],

					120 =>
						[
							'prev_upgrade_id' => 107,
							'upgrade_id' => 423,
							'reagents' => [10 => 30, 22 => 20, 44 => 10]
						]
				],

			'1.43.0' =>
				[
					121 =>
						[
							'prev_upgrade_id' => 86,
							'upgrade_id' => 424,
							'reagents' => [9 => 10, 23 => 10, 43 => 15]
						],

					122 =>
						[
							'prev_upgrade_id' => 424,
							'upgrade_id' => 425,
							'reagents' => [1 => 35, 20 => 15, 42 => 10]
						],

					123 =>
						[
							'prev_upgrade_id' => 424,
							'upgrade_id' => 426,
							'reagents' => [9 => 30, 21 => 20, 40 => 8]
						],

					124 =>
						[
							'prev_upgrade_id' => 394,
							'upgrade_id' => 427,
							'reagents' => [6 => 40, 23 => 20, 41 => 5]
						],

					125 =>
						[
							'prev_upgrade_id' => 394,
							'upgrade_id' => 428,
							'reagents' => [2 => 30, 22 => 15, 44 => 12]
						]
				],

			'1.47.0' =>
				[
					126 =>
						[
							'prev_upgrade_id' => 52,
							'upgrade_id' => 429,
							'reagents' => [3 => 35, 21 => 20, 42 => 10]
						],

					127 =>
						[
							'prev_upgrade_id' => 429,
							'upgrade_id' => 430,
							'reagents' => [10 => 30, 20 => 25, 40 => 20]
						],

					128 =>
						[
							'prev_upgrade_id' => 390,
							'upgrade_id' => 431,
							'reagents' => [1 => 40, 23 => 20, 44 => 15]
						],

					129 =>
						[
							'prev_upgrade_id' => 350,
							'upgrade_id' => 432,
							'reagents' => [4 => 50, 40 => 30, 42 => 20]
						],

					130 =>
						[
							'prev_upgrade_id' => 57,
							'upgrade_id' => 433,
							'reagents' => [0 => 40, 26 => 30, 41 => 20]
						],

					131 =>
						[
							'prev_upgrade_id' => 416,
							'upgrade_id' => 434,
							'reagents' => [3 => 50, 23 => 20, 41 => 5]
						]
				],

			'1.49.0' =>
				[
					132 =>
						[
							'prev_upgrade_id' => 31,
							'upgrade_id' => 435,
							'reagents' => [6 => 20, 24 => 15, 41 => 10]
						],

					133 =>
						[
							'prev_upgrade_id' => 435,
							'upgrade_id' => 436,
							'reagents' => [0 => 25, 21 => 20, 42 => 15]
						],

					134 =>
						[
							'prev_upgrade_id' => 436,
							'upgrade_id' => 437,
							'reagents' => [9 => 30, 24 => 25, 43 => 20]
						],

					135 =>
						[
							'prev_upgrade_id' => 360,
							'upgrade_id' => 438,
							'reagents' => [4 => 40, 20 => 30, 43 => 20]
						],

					136 =>
						[
							'prev_upgrade_id' => 361,
							'upgrade_id' => 439,
							'reagents' => [10 => 40, 26 => 30, 44 => 20]
						],

					137 =>
						[
							'prev_upgrade_id' => 367,
							'upgrade_id' => 440,
							'reagents' => [0 => 30, 26 => 25, 41 => 20]
						],

					138 =>
						[
							'prev_upgrade_id' => 420,
							'upgrade_id' => 441,
							'reagents' => [6 => 30, 24 => 25, 44 => 20]
						]
				],

			'1.50.0' =>
				[
					139 =>
						[
							'prev_upgrade_id' => 89,
							'upgrade_id' => 442,
							'reagents' => [9 => 30, 21 => 25, 43 => 20]
						],

					140 =>
						[
							'prev_upgrade_id' => 442,
							'upgrade_id' => 443,
							'reagents' => [1 => 40, 23 => 30, 40 => 20]
						]
				],

			'1.52.0' =>
				[
					141 =>
						[
							'prev_upgrade_id' => 131,
							'upgrade_id' => 444,
							'reagents' => [9 => 30, 21 => 25, 43 => 20]
						],

					142 =>
						[
							'prev_upgrade_id' => 444,
							'upgrade_id' => 445,
							'reagents' => [0 => 40, 26 => 30, 41 => 20]
						],

					143 =>
						[
							'prev_upgrade_id' => 444,
							'upgrade_id' => 446,
							'reagents' => [1 => 40, 23 => 30, 40 => 20]
						],

					144 =>
						[
							'prev_upgrade_id' => 136,
							'upgrade_id' => 447,
							'reagents' => [2 => 30, 22 => 25, 44 => 20]
						],

					145 =>
						[
							'prev_upgrade_id' => 447,
							'upgrade_id' => 448,
							'reagents' => [3 => 40, 24 => 30, 42 => 20]
						],

					146 =>
						[
							'prev_upgrade_id' => 447,
							'upgrade_id' => 449,
							'reagents' => [10 => 40, 20 => 30, 41 => 20]
						]
				],

			'1.54.0' =>
				[
					147 =>
						[
							'prev_upgrade_id' => 68,
							'upgrade_id' => 450,
							'reagents' => [6 => 8, 21 => 4, 5 => 1]
						],

					148 =>
						[
							'prev_upgrade_id' => 62,
							'upgrade_id' => 451,
							'reagents' => [4 => 8, 26 => 4, 7 => 1]
						],

					149 =>
						[
							'prev_upgrade_id' => 3,
							'upgrade_id' => 901,
							'reagents' => [6 => 10, 5 => 5, 50 => 1]
						],

					150 =>
						[
							'prev_upgrade_id' => 6,
							'upgrade_id' => 902,
							'reagents' => [9 => 10, 7 => 5, 50 => 1]
						],
				]

			# Kuroneko stop

		];

	static $craftPrices =
		[
			'1.26.0' =>
				[
					1500 =>
						[
							[
								'fuzes' => 800,
								'rubins' => 8,
								'hat' => 1011,
								'reagents' => [50 => 2]
							],

							[
								'fuzes' => 1600,
								'rubins' => 16,
								'reagents' => [50 => 3]
							]
						],

					1510 =>
						[
							[
								'fuzes' => 1200,
								'rubins' => 12,
								'hat' => [1030, 1005],
								'reagents' => [50 => 5]
							],

							[
								'fuzes' => 4800,
								'rubins' => 48,
								'reagents' => [50 => 6]
							]
						],

					1520 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'hat' => [1075, 1015],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 6400,
								'rubins' => 64,
								'reagents' => [50 => 8]
							]
						],

					1530 =>
						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'hat' => 1065,
								'artifact' => [2014, 2005],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 5800,
								'rubins' => 58,
								'reagents' => [50 => 8]
							]
						],

					1540 =>
						[
							[
								'rubins' => 15,
								'hat' => [1066, 1024],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 7200,
								'rubins' => 72,
								'reagents' => [50 => 14]
							]
						],

					1550 =>
						[
							[
								'fuzes' => 1200,
								'rubins' => 12,
								'hat' => [1057, 1091],
								'reagents' => [50 => 7]
							],

							[
								'fuzes' => 5200,
								'rubins' => 52,
								'reagents' => [50 => 7]
							]
						],

					1560 =>
						[
							[
								'fuzes' => 1400,
								'rubins' => 14,
								'hat' => [1004, 1064],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 6800,
								'rubins' => 68,
								'reagents' => [50 => 8]
							]
						],

					1570 =>
						[
							[
								'fuzes' => 2000,
								'rubins' => 20,
								'hat' => [1080, 1000],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 8600,
								'rubins' => 86,
								'reagents' => [50 => 14]
							]
						],

					1580 =>
						[
							[
								'fuzes' => 2200,
								'rubins' => 22,
								'hat' => [1074, 1096],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 8200,
								'rubins' => 82,
								'reagents' => [50 => 12]
							]
						],

					1590 =>
						[
							[
								'fuzes' => 1600,
								'rubins' => 16,
								'hat' => [1055, 1028, 1040],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 8400,
								'rubins' => 84,
								'reagents' => [50 => 10]
							]
						],

					1600 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'hat' => [1052, 1014, 1135],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 8600,
								'rubins' => 86,
								'reagents' => [50 => 12]
							]
						],

					1610 =>
						[
							[
								'fuzes' => 1400,
								'rubins' => 14,
								'hat' => [1062, 1038],
								'artifact' => [2028],
								'reagents' => [50 => 5]
							],

							[
								'fuzes' => 6200,
								'rubins' => 62,
								'reagents' => [50 => 9]
							]
						],

					1620 =>
						[
							[
								'fuzes' => 1400,
								'rubins' => 14,
								'hat' => [1061, 1079, 1103],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 9400,
								'rubins' => 94,
								'reagents' => [50 => 10]
							]
						],

					1630 =>
						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'hat' => [1010, 1012],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 3400,
								'rubins' => 34,
								'reagents' => [50 => 6]
							]
						],

					1640 =>
						[
							[
								'fuzes' => 1600,
								'rubins' => 16,
								'hat' => [1063, 1042],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 6400,
								'rubins' => 64,
								'reagents' => [50 => 6]
							]
						],

					# Start Kuroneko
					1720 =>

						[
							[
								'fuzes' => 2200,
								'rubins' => 22,
								'hat' => [1041, 1149],
								'artifact' => 2048,
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6000,
								'rubins' => 60,
								'reagents' => [50 => 16]
							]
						],

					1730 =>

						[
							[
								'fuzes' => 0,
								'rubins' => 99999,
							],

							[
								'fuzes' => 0,
								'rubins' => 99999,
							]
						],

					1740 =>

						[
							[
								'fuzes' => 0,
								'rubins' => 99999,
							],

							[
								'fuzes' => 0,
								'rubins' => 99999,
							]
						],

					1750 =>

						[
							[
								'fuzes' => 3000,
								'rubins' => 30,
								'hat' => 1002,
								'artifact' => [2057, 2018],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 5500,
								'rubins' => 55,
								'reagents' => [50 => 16]
							]
						],


					1760 =>

						[
							[
								'fuzes' => 4000,
								'rubins' => 40,
								'hat' => [1142, 1146, 1032],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6000,
								'rubins' => 60,
								'reagents' => [50 => 16]
							]
						],


					1770 =>

						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'hat' => [1102, 1018],
								'reagents' => [50 => 5]
							],

							[
								'fuzes' => 1000,
								'rubins' => 10,
								'reagents' => [50 => 5]
							]
						],
					# Stop Kuroneko

					2500 =>
						[
							[
								'fuzes' => 400,
								'rubins' => 4,
								'artifact' => [2008, 2001, 2002],
								'reagents' => [50 => 4]
							],

							[
								'fuzes' => 2400,
								'rubins' => 24,
								'reagents' => [50 => 3]
							]
						],

					2510 =>
						[
							[
								'fuzes' => 600,
								'rubins' => 6,
								'artifact' => [2003, 2004],
								'reagents' => [50 => 4]
							],

							[
								'fuzes' => 2200,
								'rubins' => 22,
								'reagents' => [50 => 4]
							]
						],

					2520 =>
						[
							[
								'fuzes' => 1500,
								'rubins' => 15,
								'artifact' => [2003, 2010, 2007],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 4400,
								'rubins' => 44,
								'reagents' => [50 => 10]
							]
						],

					2530 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'artifact' => [2006, 2009],
								'reagents' => [50 => 7]
							],

							[
								'fuzes' => 3200,
								'rubins' => 32,
								'reagents' => [50 => 12]
							]
						],

					2540 =>
						[
							[
								'fuzes' => 2000,
								'rubins' => 20,
								'artifact' => [2021, 2012],
								'reagents' => [50 => 9]
							],

							[
								'fuzes' => 7000,
								'rubins' => 70,
								'reagents' => [50 => 10]
							]
						],

					2550 =>
						[
							[
								'fuzes' => 1600,
								'rubins' => 16,
								'artifact' => [2019, 2015],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 5200,
								'rubins' => 52,
								'reagents' => [50 => 8]
							]
						],

					2560 =>
						[
							[
								'rubins' => 24,
								'hat' => [1088],
								'artifact' => [2023],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6600,
								'rubins' => 66,
								'reagents' => [50 => 12]
							]
						],

					2570 =>
						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'artifact' => [2029],
								'reagents' => [50 => 4]
							],

							[
								'fuzes' => 2400,
								'rubins' => 24,
								'reagents' => [50 => 4]
							]
						]
				],

			'1.30.0' =>
				[
					1500 =>
						[
							[
								'fuzes' => 800,
								'rubins' => 8,
								'hat' => 1011,
								'reagents' => [50 => 2]
							],

							[
								'fuzes' => 1200,
								'rubins' => 12,
								'reagents' => [50 => 4]
							]
						],

					1510 =>
						[
							[
								'fuzes' => 1200,
								'rubins' => 12,
								'hat' => [1030, 1005],
								'reagents' => [50 => 5]
							],

							[
								'fuzes' => 3800,
								'rubins' => 38,
								'reagents' => [50 => 8]
							]
						],

					1520 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'hat' => [1075, 1015],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 4400,
								'rubins' => 44,
								'reagents' => [50 => 12]
							]
						],

					1530 =>
						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'hat' => 1065,
								'artifact' => [2014, 2005],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 4800,
								'rubins' => 48,
								'reagents' => [50 => 10]
							]
						],

					1540 =>
						[
							[
								'rubins' => 15,
								'hat' => [1066, 1024],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6200,
								'rubins' => 62,
								'reagents' => [50 => 16]
							]
						],

					1550 =>
						[
							[
								'fuzes' => 1200,
								'rubins' => 12,
								'hat' => [1057, 1091],
								'reagents' => [50 => 7]
							],

							[
								'fuzes' => 3200,
								'rubins' => 32,
								'reagents' => [50 => 10]
							]
						],

					1560 =>
						[
							[
								'fuzes' => 1400,
								'rubins' => 14,
								'hat' => [1004, 1064],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 4800,
								'rubins' => 48,
								'reagents' => [50 => 12]
							]
						],

					1570 =>
						[
							[
								'fuzes' => 2000,
								'rubins' => 20,
								'hat' => [1080, 1000],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6600,
								'rubins' => 66,
								'reagents' => [50 => 18]
							]
						],

					1580 =>
						[
							[
								'fuzes' => 2200,
								'rubins' => 22,
								'hat' => [1074, 1096],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6200,
								'rubins' => 62,
								'reagents' => [50 => 16]
							]
						],

					1590 =>
						[
							[
								'fuzes' => 1600,
								'rubins' => 16,
								'hat' => [1055, 1028, 1040],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 6400,
								'rubins' => 64,
								'reagents' => [50 => 14]
							]
						],

					1600 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'hat' => [1052, 1014, 1135],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 6600,
								'rubins' => 66,
								'reagents' => [50 => 16]
							]
						],

					1610 =>
						[
							[
								'fuzes' => 1400,
								'rubins' => 14,
								'hat' => [1062, 1038],
								'artifact' => [2028],
								'reagents' => [50 => 5]
							],

							[
								'fuzes' => 4600,
								'rubins' => 46,
								'reagents' => [50 => 12]
							]
						],

					1620 =>
						[
							[
								'fuzes' => 1400,
								'rubins' => 14,
								'hat' => [1061, 1079, 1103],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 7400,
								'rubins' => 74,
								'reagents' => [50 => 14]
							]
						],

					1630 =>
						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'hat' => [1010, 1012],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 2400,
								'rubins' => 24,
								'reagents' => [50 => 8]
							]
						],

					1640 =>
						[
							[
								'fuzes' => 1600,
								'rubins' => 16,
								'hat' => [1063, 1042],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 4400,
								'rubins' => 44,
								'reagents' => [50 => 10]
							]
						],

					1650 =>
						[
							[
								'fuzes' => 2200,
								'rubins' => 22,
								'hat' => [1121, 1095, 1129],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 7000,
								'rubins' => 70,
								'reagents' => [50 => 16]
							]
						],

					2500 =>
						[
							[
								'fuzes' => 400,
								'rubins' => 4,
								'artifact' => [2008, 2001, 2002],
								'reagents' => [50 => 4]
							],

							[
								'fuzes' => 1400,
								'rubins' => 14,
								'reagents' => [50 => 5]
							]
						],

					2510 =>
						[
							[
								'fuzes' => 600,
								'rubins' => 6,
								'artifact' => [2003, 2004],
								'reagents' => [50 => 4]
							],

							[
								'fuzes' => 1200,
								'rubins' => 12,
								'reagents' => [50 => 6]
							]
						],

					2520 =>
						[
							[
								'fuzes' => 1500,
								'rubins' => 15,
								'artifact' => [2003, 2010, 2007],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 3400,
								'rubins' => 34,
								'reagents' => [50 => 12]
							]
						],

					2530 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'artifact' => [2006, 2009],
								'reagents' => [50 => 7]
							],

							[
								'fuzes' => 2200,
								'rubins' => 22,
								'reagents' => [50 => 14]
							]
						],

					2540 =>
						[
							[
								'fuzes' => 2000,
								'rubins' => 20,
								'artifact' => [2021, 2012],
								'reagents' => [50 => 9]
							],

							[
								'fuzes' => 4600,
								'rubins' => 46,
								'reagents' => [50 => 14]
							]
						],

					2550 =>
						[
							[
								'fuzes' => 1600,
								'rubins' => 16,
								'artifact' => [2019, 2015],
								'reagents' => [50 => 6]
							],

							[
								'fuzes' => 4200,
								'rubins' => 42,
								'reagents' => [50 => 10]
							]
						],

					2560 =>
						[
							[
								'rubins' => 24,
								'hat' => [1088],
								'artifact' => [2023],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 5000,
								'rubins' => 50,
								'reagents' => [50 => 15]
							]
						],

					2570 =>
						[
							[
								'fuzes' => 1000,
								'rubins' => 10,
								'artifact' => [2029],
								'reagents' => [50 => 4]
							],

							[
								'fuzes' => 1400,
								'rubins' => 14,
								'reagents' => [50 => 6]
							]
						],

					2580 =>
						[
							[
								'fuzes' => 3200,
								'rubins' => 32,
								'artifact' => [2039, 2019],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 5400,
								'rubins' => 54,
								'reagents' => [50 => 14]
							]
						],

					# Start Kuroneko
					2630 =>

						[
							[
								'fuzes' => 3000,
								'rubins' => 30,
								'hat' => 1059,
								'artifact' => [2046, 2020],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 5200,
								'rubins' => 52,
								'reagents' => [50 => 14]
							]
						],


					2640 =>

						[
							[
								'fuzes' => 2200,
								'rubins' => 22,
								'hat' => 1077,
								'artifact' => [2043, 2031],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 5400,
								'rubins' => 54,
								'reagents' => [50 => 14]
							]
						],


					2650 =>

						[
							[
								'fuzes' => 0,
								'rubins' => 99999,
							],

							[
								'fuzes' => 0,
								'rubins' => 99999,
							]
						],

					2660 =>

						[
							[
								'fuzes' => 0,
								'rubins' => 99999,
							],

							[
								'fuzes' => 0,
								'rubins' => 99999,
							]
						],

					2670 =>

						[
							[
								'fuzes' => 3200,
								'rubins' => 32,
								'artifact' => [2049, 2058, 2027],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 5600,
								'rubins' => 56,
								'reagents' => [50 => 16]
							]
						],
					# Stop Kuroneko
				],

			'1.35.0' =>
				[
					1660 =>
						[
							[
								'fuzes' => 1800,
								'rubins' => 18,
								'hat' => [1056, 1058, 1123],
								'reagents' => [50 => 8]
							],

							[
								'fuzes' => 5800,
								'rubins' => 58,
								'reagents' => [50 => 18]
							]
						],

					2610 =>
						[
							[
								'fuzes' => 2000,
								'rubins' => 20,
								'hat' => 1117,
								'artifact' => [2011, 2017],
								'reagents' => [50 => 10]
							],

							[
								'fuzes' => 4800,
								'rubins' => 48,
								'reagents' => [50 => 14]
							]
						]
				]
		];

	static $coopReward =
		[
			'1.26.0' =>
				[
					101 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [25 => 2, 11 => 5, 41 => 2],
								'hat' => 1068
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [25 => 1, 11 => 5, 41 => 2],
								'hat' => 1068
							]
						],

					102 =>
						[
							[
								'rubins' => 1,
								'exp' => 60,
								'weapons' => [57 => 2, 64 => 1, 81 => 2],
								'hat' => 1069
							],

							[
								'fuzes' => 80,
								'exp' => 30,
								'weapons' => [57 => 2, 64 => 1, 81 => 2],
								'hat' => 1069
							]
						],

					103 =>
						[
							[
								'rubins' => 2,
								'exp' => 80,
								'weapons' => [72 => 4, 24 => 2, 26 => 3],
								'hat' => 1068
							],

							[
								'fuzes' => 90,
								'exp' => 40,
								'weapons' => [72 => 2, 24 => 2, 26 => 3],
								'hat' => 1072
							]
						],

					104 =>
						[
							[
								'rubins' => 2,
								'exp' => 80,
								'weapons' => [80 => 4, 41 => 2, 28 => 2],
								'hat' => 1076
							],

							[
								'fuzes' => 90,
								'exp' => 40,
								'weapons' => [80 => 2, 41 => 2, 28 => 1],
								'hat' => 1076
							]
						],

					105 =>
						[
							[
								'rubins' => 2,
								'exp' => 100,
								'weapons' => [72 => 4, 48 => 3, 36 => 2],
								'hat' => 1073
							],

							[
								'fuzes' => 100,
								'exp' => 50,
								'weapons' => [72 => 2, 48 => 3, 36 => 1],
								'hat' => 1073
							]
						],

					106 =>
						[
							[
								'rubins' => 2,
								'exp' => 100,
								'weapons' => [80 => 4, 82 => 2, 35 => 2],
								'artifact' => 2007
							],

							[
								'fuzes' => 100,
								'exp' => 50,
								'weapons' => [80 => 2, 82 => 1, 35 => 2],
								'artifact' => 2007
							]
						],

					107 =>
						[
							[
								'rubins' => 3,
								'exp' => 120,
								'weapons' => [80 => 4, 72 => 4, 84 => 4],
								'hat' => 1117
							],

							[
								'fuzes' => 120,
								'exp' => 60,
								'weapons' => [80 => 2, 72 => 2, 84 => 2],
								'hat' => 1117
							]
						],

					108 =>
						[
							[
								'rubins' => 3,
								'exp' => 120,
								'weapons' => [80 => 4, 72 => 4, 86 => 4],
								'hat' => 1116
							],

							[
								'fuzes' => 120,
								'exp' => 60,
								'weapons' => [80 => 2, 72 => 2, 86 => 2],
								'hat' => 1116
							]
						],

					109 =>
						[
							[
								'rubins' => 3,
								'exp' => 150,
								'weapons' => [80 => 4, 72 => 4, 91 => 4],
								'hat' => 1120
							],

							[
								'fuzes' => 150,
								'exp' => 75,
								'weapons' => [80 => 2, 72 => 2, 91 => 2],
								'hat' => 1120
							]
						],

					110 =>
						[
							[
								'rubins' => 3,
								'exp' => 150,
								'weapons' => [80 => 4, 72 => 4, 88 => 4],
								'hat' => 1123
							],

							[
								'fuzes' => 150,
								'exp' => 75,
								'weapons' => [80 => 2, 72 => 2, 88 => 2],
								'hat' => 1123
							]
						],

					111 =>
						[
							[
								'rubins' => 3,
								'exp' => 150,
								'weapons' => [80 => 4, 72 => 4, 86 => 6],
								'artifact' => 2023
							],

							[
								'fuzes' => 150,
								'exp' => 75,
								'weapons' => [80 => 2, 72 => 2, 86 => 3],
								'artifact' => 2023
							]
						],

					112 =>
						[
							[
								'rubins' => 3,
								'exp' => 150,
								'weapons' => [80 => 4, 100 => 4, 76 => 6],
								'hat' => 1133
							],

							[
								'fuzes' => 150,
								'exp' => 75,
								'weapons' => [80 => 2, 100 => 2, 76 => 3],
								'hat' => 1133
							]
						],

					113 =>
						[
							[
								'rubins' => 4,
								'exp' => 160,
								'weapons' => [80 => 6, 72 => 6, 106 => 3],
								'artifact' => 2031
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [80 => 3, 72 => 3, 106 => 1],
								'artifact' => 2031
							]
						],

					114 =>
						[
							[
								'rubins' => 5,
								'exp' => 160,
								'weapons' => [80 => 6, 72 => 6, 104 => 3],
								'hat' => 1142
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [80 => 3, 72 => 3, 104 => 1],
								'hat' => 1142
							]
						]
				],

			'1.30.0' =>
				[
					115 =>
						[
							[
								'rubins' => 5,
								'exp' => 160,
								'weapons' => [80 => 6, 72 => 6, 106 => 3],
								'artifact' => 2036
							],

							[
								'fuzes' => 160,
								'exp' => 80,
								'weapons' => [80 => 3, 72 => 3, 106 => 1],
								'artifact' => 2036
							]
						]
				]
		];

	static $coliseumticket = [[null, 10]];
	static $changeclandescr = [[null, 5]];
	static $changeclanemblem = [[null, 5]];

	static $clanlevels =
		[
			1 => [null, 50],
			2 => [null, 100],
			3 => [null, 150],
			4 => [null, 200]
		];

	static $stuff_prices = [];
	static $merc;
}

$merc =
	'[{
    "id":-1,
    "level":5,
    "name":"Merc1",
    "attack":10,
    "armor":0,
    "race":2,
    "price":300,
    "realPrice":3
},{
    "id":-2,
    "level":5,
    "name":"Merc2",
    "attack":4,
    "armor":6,
    "race":5,
    "hatId":1003,
    "price":500,
    "realPrice":5
},{
    "id":-3,
    "level":6,
    "name":"Merc3",
    "attack":8,
    "armor":4,
    "race":4,
    "price":700,
    "realPrice":7
},{
    "id":-4,
    "level":7,
    "name":"Merc4",
    "attack":10,
    "armor":4,
    "race":2,
    "hatId":1004,
    "price":600,
    "realPrice":6
},{
    "id":-5,
    "level":8,
    "name":"Merc5",
    "attack":2,
    "armor":14,
    "race":5,
    "price":600,
    "realPrice":6
},{
    "id":-6,
    "level":8,
    "name":"Merc6",
    "attack":10,
    "armor":6,
    "race":4,
    "hatId":1006,
    "price":900,
    "realPrice":9
},{
    "id":-7,
    "level":9,
    "name":"Merc7",
    "attack":8,
    "armor":10,
    "race":2,
    "hatId":1102,
    "price":800,
    "realPrice":8
},{
    "id":-8,
    "level":10,
    "name":"Merc8",
    "attack":20,
    "armor":0,
    "race":5,
    "hatId":1005,
    "price":900,
    "realPrice":9
},{
    "id":-9,
    "level":11,
    "name":"Merc9",
    "attack":6,
    "armor":16,
    "race":3,
    "price":900,
    "realPrice":9
},{
    "id":-10,
    "level":11,
    "name":"Merc10",
    "attack":14,
    "armor":8,
    "race":4,
    "hatId":1023,
    "price":1000,
    "realPrice":10
},{
    "id":-11,
    "level":12,
    "name":"Merc11",
    "attack":4,
    "armor":20,
    "race":2,
    "hatId":1016,
    "price":900,
    "realPrice":9
},{
    "id":-12,
    "level":13,
    "name":"Merc12",
    "attack":12,
    "armor":14,
    "race":3,
    "hatId":1031,
    "price":1500,
    "realPrice":15
},{
    "id":-13,
    "level":14,
    "name":"Merc13",
    "attack":26,
    "armor":2,
    "race":5,
    "hatId":1010,
    "price":1000,
    "realPrice":10
},{
    "id":-14,
    "level":14,
    "name":"Merc14",
    "attack":18,
    "armor":10,
    "race":4,
    "hatId":1098,
    "price":1100,
    "realPrice":11
},{
    "id":-15,
    "level":15,
    "name":"Merc15",
    "attack":22,
    "armor":8,
    "race":6,
    "price":1200,
    "realPrice":12
},{
    "id":-16,
    "level":16,
    "name":"Merc16",
    "attack":12,
    "armor":20,
    "race":2,
    "hatId":1024,
    "price":1100,
    "realPrice":11
},{
    "id":-17,
    "level":17,
    "name":"Merc17",
    "attack":18,
    "armor":16,
    "race":3,
    "hatId":1012,
    "artifactId":2004,
    "price":1300,
    "realPrice":13
},{
    "id":-18,
    "level":17,
    "name":"Merc18",
    "attack":32,
    "armor":2,
    "race":4,
    "artifactId":2001,
    "price":1200,
    "realPrice":12
},{
    "id":-19,
    "level":18,
    "name":"Merc19",
    "attack":24,
    "armor":12,
    "race":7,
    "price":1300,
    "realPrice":13
},{
    "id":-20,
    "level":19,
    "name":"Merc20",
    "attack":16,
    "armor":22,
    "race":5,
    "artifactId":2002,
    "price":1200,
    "realPrice":12
},{
    "id":-21,
    "level":20,
    "name":"Merc21",
    "attack":6,
    "armor":34,
    "race":2,
    "hatId":1029,
    "price":1300,
    "realPrice":13
},{
    "id":-22,
    "level":20,
    "name":"Merc22",
    "attack":26,
    "armor":14,
    "race":6,
    "hatId":1078,
    "price":1500,
    "realPrice":15
},{
    "id":-23,
    "level":21,
    "name":"Merc23",
    "attack":32,
    "armor":10,
    "race":8,
    "price":1300,
    "realPrice":13
},{
    "id":-24,
    "level":22,
    "name":"Merc24",
    "attack":42,
    "armor":2,
    "race":7,
    "artifactId":2004,
    "price":1500,
    "realPrice":15
},{
    "id":-25,
    "level":23,
    "name":"Merc25",
    "attack":20,
    "armor":26,
    "race":3,
    "hatId":1077,
    "price":1800,
    "realPrice":18
},{
    "id":-26,
    "level":23,
    "name":"Merc26",
    "attack":28,
    "armor":18,
    "race":5,
    "hatId":1097,
    "price":1400,
    "realPrice":14
},{
    "id":-27,
    "level":24,
    "name":"Merc27",
    "attack":12,
    "armor":36,
    "race":4,
    "hatId":1030,
    "price":1900,
    "realPrice":19
},{
    "id":-28,
    "level":25,
    "name":"Merc28",
    "attack":34,
    "armor":16,
    "race":6,
    "artifactId":2005,
    "price":1800,
    "realPrice":18
},{
    "id":-29,
    "level":25,
    "name":"Merc29",
    "attack":22,
    "armor":28,
    "race":2,
    "hatId":1015,
    "price":1800,
    "realPrice":18
},{
    "id":-30,
    "level":26,
    "name":"Merc30",
    "attack":26,
    "armor":26,
    "race":8,
    "hatId":1064,
    "price":2300,
    "realPrice":23
},{
    "id":-31,
    "level":26,
    "name":"Merc31",
    "attack":42,
    "armor":10,
    "race":7,
    "artifactId":2010,
    "price":2200,
    "realPrice":22
},{
    "id":-32,
    "level":27,
    "name":"Merc32",
    "attack":36,
    "armor":18,
    "race":5,
    "hatId":1122,
    "price":2100,
    "realPrice":21
},{
    "id":-33,
    "level":27,
    "name":"Merc33",
    "attack":22,
    "armor":32,
    "race":4,
    "hatId":1014,
    "artifactId":2008,
    "price":2400,
    "realPrice":24
},{
    "id":-34,
    "level":28,
    "name":"Merc34",
    "attack":30,
    "armor":26,
    "race":7,
    "hatId":1102,
    "artifactId":2009,
    "price":3300,
    "realPrice":33
},{
    "id":-35,
    "level":28,
    "name":"Merc35",
    "attack":8,
    "armor":48,
    "race":3,
    "hatId":1030,
    "price":2600,
    "realPrice":26
},{
    "id":-36,
    "level":29,
    "name":"Merc36",
    "attack":48,
    "armor":10,
    "race":6,
    "hatId":1047,
    "price":3000,
    "realPrice":30
},{
    "id":-37,
    "level":29,
    "name":"Merc37",
    "attack":26,
    "armor":32,
    "race":4,
    "hatId":1002,
    "price":2800,
    "realPrice":28
},{
    "id":-38,
    "level":30,
    "name":"Merc38",
    "attack":44,
    "armor":16,
    "race":2,
    "hatId":1051,
    "price":2900,
    "realPrice":29
},{
    "id":-39,
    "level":30,
    "name":"Merc39",
    "attack":52,
    "armor":8,
    "race":8,
    "hatId":1084,
    "artifactId":2015,
    "price":4000,
    "realPrice":40
},{
    "id":-40,
    "level":30,
    "name":"Merc40",
    "attack":18,
    "armor":42,
    "race":5,
    "hatId":1042,
    "price":3100,
    "realPrice":31
},{
    "id":-41,
    "level":30,
    "name":"Merc41",
    "attack":22,
    "armor":38,
    "race":3,
    "hatId":1057,
    "price":3300,
    "realPrice":33
},{
    "id":-42,
    "level":9,
    "name":"Merc42",
    "attack":14,
    "armor":4,
    "race":9,
    "hatId":1009,
    "price":1000,
    "realPrice":10
},{
    "id":-43,
    "level":19,
    "name":"Merc43",
    "attack":24,
    "armor":14,
    "race":9,
    "hatId":1132,
    "price":1500,
    "realPrice":15
},{
    "id":-44,
    "level":22,
    "name":"Merc44",
    "attack":6,
    "armor":38,
    "race":9,
    "hatId":1131,
    "price":1600,
    "realPrice":16
},{
    "id":-45,
    "level":24,
    "name":"Merc45",
    "attack":24,
    "armor":24,
    "race":9,
    "hatId":1065,
    "artifactId":2014,
    "price":2200,
    "realPrice":22
},{
    "id":-46,
    "level":29,
    "name":"Merc46",
    "attack":34,
    "armor":24,
    "race":9,
    "hatId":1130,
    "price":2900,
    "realPrice":29
}]';

$merc = json_decode($merc);

# сопоставляем индексы-ID
foreach ($merc as $key => $value)
{
	$value->type = 1;
	$value->active = 1;
	$value->user_id = $value->id;
	$value->login = $value->name ?? 'UMerc';
	$value->fuzes = 0;
	$value->rubins = 0;
	$value->rating = 0;
	$value->stuff = $value->weapons = $value->recipes = [];
	$value->hat_id = $value->hatId ?? 0;
	$value->artifact_id = $value->artifactId ?? 0;
	$value->experience = 0;
	$value->reaction = 0;
	$value->clan_name = 'Mercs clan';

	$merc[$value->id] = $value;
	unset($merc[$key]);
}

Items::$merc = $merc;

# Автозаполнение цен
foreach
(
	[
		Items::$hats_prices,
		Items::$artifacts_prices,
		Items::$boosters_prices
	]
	as $stuff_arr
)
	foreach ($stuff_arr as $version => $prices)
		foreach ($prices as $key => $value)
			Items::$stuff_prices[$version][$key] = $value;

# Автозаполнение улучшений для возможности in_array()
foreach (Items::$related_recipes as $version => $recipes)
	foreach ($recipes as $recipeTree)
		if (is_array($recipeTree))
		{
			foreach ($recipeTree as $recipe)
				if (is_int($recipe))
					Items::$recipes[$version][] = $recipe;
				elseif (is_array($recipe))
					foreach ($recipe as $r)
					{
						if (is_int($r))
							Items::$recipes[$version][] = $r;
						else
							throw new Exception("wrong type: ".gettype($r));
					}
		}
		elseif (is_int($recipeTree))
			Items::$recipes[$version][] = $recipeTree;
		else
			throw new Exception("wrong type: ".gettype($recipeTree));

function sub_all(&$arr, $sub)
{
	foreach ($arr as &$val)
		if (is_numeric($val))
			$val -= $sub;
		elseif (is_array($val))
			sub_all($val, $sub);
}

$magicSubAll = 300;
# не знаю почему, но такой косяк, внутри свфшки стоят id > 300,
# но вот приходят в запросах на апгрейд, даунгрейд и в ответ на авторизацию < 300
sub_all(Items::$recipes, $magicSubAll);
# тот же геморр с < > 300
sub_all(Items::$related_recipes, $magicSubAll);
